import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';

/*
  Generated class for the BooksProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class BooksProvider {
  bookschina: any;
  bookscomic:any;
  yunovelbook:any;
  literaturebooks:any;
  homebooks:any;

  
  constructor(public http: HttpClient) 
  {
    this.bookschina=[
      {
        id: 1,
        name: "ข้าจะเป็นเซียน เล่ม 1-3 (3 เล่มจบ)",
        author : "เย่ว์เซี่ยเตี๋ยอิ่ง (Yue Xia Die Ying)",
        publisher : "อรุณ",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "คงโหว องค์หญิงสิ้นบัลลังก์ผู้เติบโตในตำหนักลึกของวังหลวงโดยไม่มีใครดูดำดูดี โชคชะตานำพาให้นางเข้าสู่แดนพ้นโศกดินแดนแห่งการบำเพ็ญเพียร เพื่อมุ่งสู่วิถีแห่งเซียนเมื่ออายุเกือบสิบขวบ ชีวิตใหม่มีผู้คนที่รักใคร่เอ็นดูนางมากมายมีเรื่องราวสนุกสนานหลากหลายจากองค์หญิงผู้แสนอาภัพในแดนมนุษย์สู่ผู้บำเพ็ญเพียรหญิงผู้มีพรสวรรค์ น่ารักน่าเอ็นดู และมาพร้อมกับความดวงดี อุปสรรคนานาที่ต้องเผชิญ ทั้งปีศาจ มารร้าย ดินแดนลี้ลับน่ะหรือ แค่นี้ไม่ระย่อ!",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201909/489506/1000224306_front_XXL.jpg?imgname=%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%88%E0%B8%B0%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B9%80%E0%B8%8B%E0%B8%B5%E0%B8%A2%E0%B8%99-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-1-3-(3-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1%E0%B8%88%E0%B8%9A)",
        price : "948.00 บาท",
      },
      {
        id: 2,
        name: "ภรรยาจำนนรัก เล่ม 1-2 (2 เล่มจบ)",
        author : "โม่เหยียน",
        publisher : "แจ่มใส",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "มู่เซียงหนิง แต่งเข้าจวนแม่ทัพมาหนึ่งปีเต็ม แต่ไม่มีสักวันที่ได้ใช้ชีวิตเยี่ยงสามีภรรยากับเขา... แม่ทัพฤทธิ์ขจรผู้ยิ่งใหญ่เกรียงไกรเช่น ฉู่ชิงหยาง ในวันที่ความทุกข์ระทมตรอมตรมใจแผดเผานางจนหมองไหม้ เขาก็ได้ถูกลบเลือนออกไปจากหัวใจนาง... เมื่อในสมองและหัวใจนางไม่มี ฉู่ชิงหยาง ผู้เป็น สามี อีกต่อไป นางก็ต้องการได้รับอิสระในการใช้ชีวิตเช่นที่เคยได้รับคืนมาอีกครามู่เซียงหนิงต้องการหย่า แต่ฉู่ชิงหยางกลับยืนยันว่า ไม่ยามนี้เขาหลงใหลในลักษณะนิสัยและ ‘เรือนร่าง’ แบบบางของนางเสียแล้วทว่าพอเขาไม่ยอมหย่า นางก็หนีจากไป จะปราบพยศภรรยาผู้นี้ให้ยอมจำนนได้นั้นมิใช่เรื่องง่ายเลยจริง ๆ !",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201811/246044/1000213359_front_XXL.jpg?imgname=%E0%B8%A0%E0%B8%A3%E0%B8%A3%E0%B8%A2%E0%B8%B2%E0%B8%88%E0%B8%B3%E0%B8%99%E0%B8%99%E0%B8%A3%E0%B8%B1%E0%B8%81-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-1-2-(2-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1%E0%B8%88%E0%B8%9A)",
        price : "339.15 บาท",  
      },
      {
        id: 3,
        name: "องครักษ์เคียงคู่ เล่ม 3 ชุด คุณชายสกุลเนี่ย",
        author : "อวี๋ฉิง",
        publisher : "แจ่มใส",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "นาง ฝานสุยอวี้ เป็นผู้อารักขาของเขา เนี่ยยางยง ผู้ซึ่งเป็นถึงราชาแห่งเกาะจิ้งจอกผู้ยิ่งใหญ่และยังมีตัวตนที่แท้จริงเป็นถึงหนึ่งในคุณชายสกุลเนี่ย! ทว่าวรยุทธ์นางยังเรียกได้ว่าอ่อนด้อยนักมิได้ช่ำชองเช่นการวาดภาพ หมากล้อม ลายอักษร หรือร่างแบบเรือ แต่ราชาโจรสลัดของชาวฮั่นผู้นี้กลับให้นางอยู่เคียงใกล้ ทั้งที่มีผู้อารักขาที่เก่งกาจอีกคนอยู่ข้างกายเขาอยู่แล้ว รวมถึงเขายังมีเภทภัยจากเกาะแฝด จากแผ่นดินใหญ่ และจากชาวต่างชาติรออยู่มากมิหนำซ้ำชาติกำเนิดของนางก็ยังไม่แน่ชัด เขากลับไว้ใจนางถึงเพียงนี้ หรือว่าคำกล่าวที่ว่า เขาเลี้ยงนางไว้เพื่อให้แต่งเป็นภรรยาตนจะเป็นเรื่องจริงกันนะ เช่นนั้นการที่เขาใช้มือเลื่อนไปตามเอวเปลือยเปล่าของนางเหล่านี้ทั้งหมดล้วนเป็นเพราะเหตุนี้หรือนี่ !",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201911/493531/1000227068_front_XXL.jpg?imgname=%E0%B8%AD%E0%B8%87%E0%B8%84%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%A9%E0%B9%8C%E0%B9%80%E0%B8%84%E0%B8%B5%E0%B8%A2%E0%B8%87%E0%B8%84%E0%B8%B9%E0%B9%88-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-3-%E0%B8%8A%E0%B8%B8%E0%B8%94-%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B8%8A%E0%B8%B2%E0%B8%A2%E0%B8%AA%E0%B8%81%E0%B8%B8%E0%B8%A5%E0%B9%80%E0%B8%99%E0%B8%B5%E0%B9%88%E0%B8%A2",
        price : "177.65 บาท",  
      },
      {
        id: 4,
        name: "แนบเนื้อเทวะ เล่ม 2 (เล่มจบ)",
        author : "อีตู้จวินหัว",
        publisher : "ห้องสมุดดอตคอม",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "ว่ากันว่า...หากเสพเนื้อเทพคำหนึ่งจะแข็งแกร่งไปถึงก้นบึ้งของจิตวิญญาณ ไม่แก่ชรา ไม่แตกดับ อยู่เหนือวัฏฏะสังสาร เพราะมันดีอย่างนี้ เหล่าปีศาจไม่ว่าน้อยใหญ่ต่างพากันออกล่า ‘เจ้าอารามหรงเฉินจื่อ นักพรตเลื่องชื่อที่ถูกทำนายว่าเป็น เทพดาวเหนือ มาจุติ ร้อนไปถึง ‘เจ้าสมุทรทะเลใต้’ ที่ทนดูไม่ได้ ต้องแอบขึ้นมาช่วยเหลือ ก็ทำไมล่ะ ทีพระถัง ยังมีทั้งปีศาจลิง หมู ปลา มาคอยดูแล แล้วเจ้าอารามหรงจะมี  ปีศาจหอย อย่างนาง มาคอยดูแลบ้างไม่ได้รึ ? เอ้าทุกคน... ช่วยถอยหน่อย เจ้าทะเลมาแล้ว!",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201901/249220/1000214974_front_XXL.jpg?imgname=%E0%B9%81%E0%B8%99%E0%B8%9A%E0%B9%80%E0%B8%99%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B9%80%E0%B8%97%E0%B8%A7%E0%B8%B0-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-2-(%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1%E0%B8%88%E0%B8%9A)",
        price : "293.25 บาท",  
      },
      {
        id: 5,
        name: "อาจารย์ข้าน่ารังแกที่สุด!",
        author : "ชิวรั่วเยีย",
        publisher : "แจ่มใส",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "เป็นเพราะสำนักหลันไถบันทึกการเกิดของ ฉืออิ๋ง ว่าตรงกับวันที่มีดาวหาง ถือว่าไม่เป็นมงคล นางจึงฝังใจว่าฉายา ดาวหายนะ ของตนเริ่มมีเพราะบันทึกนี้ และหาทางเล่นงานหลันไถเพื่อเอาคืน ทว่าคนที่นางให้ออกหน้าแทนกลับโดนลดขั้น โดนโยกย้าย บ้างก็ถูกลงโทษ ขุดคุ้ยความผิด... ทว่าหลันไถกลับยังอยู่รอด ! ในเมื่อเล่นงาน สำนักหลันไถ ศัตรูหมายเลขหนึ่งไม่ได้เสียที นางจึงได้แต่พุ่งเป้าไปที่ ไป๋สิงเจี่ยน ผู้ที่เป็นทั้งอาจารย์และหัวหน้าสำนักหลันไถ ชนิดที่ว่าเขาไม่ชอบให้ใครสัมผัสกายเพราะผื่นแดงจะขึ้น... นางก็จะไปใกล้ๆ เขา หนุนขาเขาต่างหมอน เขาไม่ชอบให้ใครอ่านบันทึกลับ... นางก็จะบุกหอตำราเพื่ออ่าน หากเขาห้าม... นางก็จะร้องไห้เสียงดังๆ จนกว่าเขาจะยอม เมื่อเขางกกระทั่งผลอิงเถา ปลูกไว้โดยไม่ยอมให้ใครกิน... นางก็จะบุกไปถึงบ้านเขา ใช้เขาเก็บอิงเถาให้นางกินเสียเลยในเมื่อเขาไม่ชอบกินเนื้อสัตว์... นางก็จะจับไก่ที่บินมาเกาะกำแพงบ้านเขาแล้วบังคับเขากิน ! สิบปีรังแกเขาก็ไม่สาย แต่เหตุใดแทนที่ ‘คนถูกรังแก’ จะผลักไส ดุด่า ต่อว่า เขากลับไม่พูดว่าอะไร ร้องขออะไรก็ทำให้เสียอย่างนั้น เหอะ จะให้นางรังแกเขาจนเหนื่อยและเลิกไปเองน่ะหรือ อย่าได้หวังเลย! ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/202001/499177/1000230387_front_XXL.jpg?imgname=%E0%B8%AD%E0%B8%B2%E0%B8%88%E0%B8%B2%E0%B8%A3%E0%B8%A2%E0%B9%8C%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B9%88%E0%B8%B2%E0%B8%A3%E0%B8%B1%E0%B8%87%E0%B9%81%E0%B8%81%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%AA%E0%B8%B8%E0%B8%94!",
        price : "322.15 บาท",  
      },
      {
        id: 6,
        name: "ยอดหมอหญิงพลิกชะตา เล่ม 1 (6 เล่มจบ)",
        author : "Yi Qian Chong",
        publisher : "แฮปปี้ บานานา",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "แม้สวรรค์จะให้โอกาสนางได้เกิดใหม่ แต่ฐานะบ้านรองนายอำเภออันช่างยากจนข้นแค้น บิดาอันเป่าเหลียงแม้เป็นรองนายอำเภอ แต่ที่บ้านกลับอัตคัดขัดสน มีหนี้สินมากมาย ท่านย่าเย็นชา มารดาอ่อนแอ ยังมีอนุที่ร้ายกาจจ้องจะหาโอกาสทำร้ายอยู่ข้างๆ ที่แย่ยิ่งไปกว่านั้นคือ ด้วยการใส่ร้ายป้ายสีของอนุทำให้บิดากับผู้เป็นย่าล้วนไม่ชอบนาง มีเพียงอู๋จิงหมอเทวดาผู้มีชื่อเสียงเลื่องลือไปทั่วเป็นความหวังเพียงหนึ่งเดียวของนาง อาศัยโอกาสตอนช่วยอู๋จิงคัดตำรา อันอี๋พยายามทุกทางเพื่อให้อู๋จิงรับนางเป็นลูกศิษย์ นางตั้งใจเล่าเรียนวิชาแพทย์ นอกจากเพื่อให้ชีวิตความเป็นอยู่ของครอบครัวดีขึ้น พยายามทำให้สกุลอันสุขสบายขึ้นแล้ว จุดประสงค์อันยิ่งใหญ่ที่สุดคือการล้างแค้น พวกคนชั่วในเมืองหลวงอันห่างไกลที่เคยทำร้ายนางรอก่อนเถอะ นางจะใช้มือที่เชี่ยวชาญวิชาแพทย์คู่นี้ให้เป็นประโยชน์ ใช้เลือดชดใช้หนี้เลือด ใช้วิธีตาต่อตาฟันต่อฟัน ! ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/202003/501997/1000231863_front_XXL.jpg?imgname=%E0%B8%A2%E0%B8%AD%E0%B8%94%E0%B8%AB%E0%B8%A1%E0%B8%AD%E0%B8%AB%E0%B8%8D%E0%B8%B4%E0%B8%87%E0%B8%9E%E0%B8%A5%E0%B8%B4%E0%B8%81%E0%B8%8A%E0%B8%B0%E0%B8%95%E0%B8%B2-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-1-(6-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1%E0%B8%88%E0%B8%9A)",
        price : "318.75 บาท",  
      },
      {
        id: 7,
        name: "ปิดแผ่นฟ้าทุบปฐพี เล่ม 1",
        author : "หรงจิ่ว (Rong Jiu)",
        publisher : "อรุณ",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "องค์หญิงเซียงอี๋ตกหน้าผาทำให้ความจำเสื่อม เนี่ยหรานที่สูญเสียความทรงจำเช่นกันได้ช่วยเหลือนางไว้และตั้งชื่อให้นางว่า เหอเฟิง หลังจากเนี่ยหรานฟื้นความทรงจำก็จดจำเหอเฟิงไม่ได้ และเขากำลังจะแต่งงานกับเจ้าเยียนหราน เพื่อนสมัยวัยเยาว์และเป็นธิดาของอัครเสนาบดีเจ้า เมื่อราชบุตรเขยซ่งหลางเซิงเจอเหอเฟิงก็พานางกลับตำหนักองค์หญิง เรื่องยุ่งๆ ก็ตามมา ไม่ว่าจะเป็นเรื่องของชายบำเรอในตำหนัก ราชสำนัก และผู้ที่วางยาลืมวิญญาณแก่นาง ราชบุตรเขยขึ้นครองราชย์ เขาไม่ได้แต่งตั้งพระสนม ในใจเขามีแต่องค์หญิง เขาออกตามหานางถึงแปดปี ในที่สุดเขาก็หานางพบ และรู้ว่าตัวเองมีบุตรสาวคนหนึ่งอายุเจ็ดขวบ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201906/480282/1000219882_front_XXL.jpg?imgname=%E0%B8%9B%E0%B8%B4%E0%B8%94%E0%B9%81%E0%B8%9C%E0%B9%88%E0%B8%99%E0%B8%9F%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%B8%E0%B8%9A%E0%B8%9B%E0%B8%90%E0%B8%9E%E0%B8%B5-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-1",
        price : "293.25 บาท",  
      },
      {
        id: 8,
        name: "ชุดเล่ห์รักทรราช 1-3",
        author : "อวี๋ฉิง",
        publisher : "แจ่มใส",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "เล่มแรกนี้เป็นเรื่องราวของ หร่วนตงเฉียน ขุนนางในราชสำนัก ด้วยนิสัยที่รักความเป็นธรรม และมิอาจทนมองเห็นความไม่ถูกต้องของเหล่าขุนนางที่คิดคดได้ ส่วน เขา เป็นขุนนางคนที่มีอำนาจล้นฟ้า อยู่เหนือคนนับหมื่นอยู่ใต้คนเพียงคนเดียวหนำซ้ำยังเป็นบุคคลที่หร่วนตงเฉียนจงเกลียดจงชังเป็นนักหนา เพราะ เขา เป็นบุคคลประเภทที่ใช้อำนาจบารมีข่มเหงคนดี เป็นขุนนางที่ร้ายกาจ ทว่าหร่วนตงเฉียนเองก็มีความลับหนึ่งที่ไม่สามารถบอกแก่ใครให้ล่วงรู้ได้ แต่เมื่อ เขา คนนั้นล่วงรู้แล้ว เช่นนั้นหร่วนตงเฉียนจะทำเช่นไร ขอเชิญนักอ่านทุกท่านร่วมเป็นกำลังใจให้กับหร่วนตงเฉียน	เล่มสองเรื่องราวระหว่าง ตงฟางเฟย และ หร่วนตงกู้ คนทั้งสองนั้นถึงแม้จะต่างปณิธานกัน แต่เรื่องความรักของทั้งคู่ต่างดำเนินไปด้วยกัน เรื่องราวในเล่มนี้เป็นเหตุการณ์หลังจากที่หร่วนตงกู้แสร้งตาย และตงฟางเฟยจอมมารแห่งราชสำนักยอมสละตำแหน่งอันสูงส่ง ส่วนเรื่องราวต่อจากนี้จะเป็นเช่นไรต่อไป เชิญนักอ่านทุกท่านในหน้าถัดไปได้เลยค่ะ	ในภาคพิเศษนี้เป็นเรื่องราวเมื่อครั้งอดีตของเหล่าตัวละครในเรื่องเล่ห์รักทรราชอย่างพี่ชายร่วมสาบาน เฟิ่งอีหลาง และ ไหวหนิง แม้กระทั่งเรื่องราวความรักของพี่ชายแท้ ๆ ของหร่วนตงกู้อย่าง หร่วนว่อชิว อีกด้วย เป็นอย่างไรกันบ้างคะ น่าอ่านมาก ๆ เลยใช่ไหมคะ ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201703/210428/1000194539_front_XXL.jpg?imgname=%E0%B8%8A%E0%B8%B8%E0%B8%94%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%AB%E0%B9%8C%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%97%E0%B8%A3%E0%B8%A3%E0%B8%B2%E0%B8%8A-1-3",
        price : "696.15 บาท",  
      },
      {
        id: 9,
        name: "คุณชายหวงรัก",
        author : "ถังอิน",
        publisher : "แจ่มใส",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "เขาคือ ตงฟางหลิง คุณชายใหญ่หัวหน้าตระกูลตงฟางที่ผู้คนเคารพยำเกรง บิดาหมั้นหมายเขาไว้กับบุตรสาวตระกูลฟางที่หายตัวไป จนบัดนี้ก็ยังไม่รู้เป็นตายร้ายดี เขาหวังเพียงว่าจะไม่พบตัวนางในเร็ววันนี้ และเฝ้ารออย่างอดทนให้ตนผ่านพ้นอายุยี่สิบห้าไปเสียที จะได้เป็นอิสระในการเลือกคู่ครอง ระหว่างที่รอคอยอย่างอกสั่นขวัญแขวน สาวน้อยที่พบกันโดยบังเอิญก็ทำให้เขารู้สึกหวั่นไหว ถึงแม้นางจะเคยทำร้ายเขา และเขาก็ยังไม่รู้แน่ชัดว่านางปลอมตัวมาเป็นสาวใช้ในคฤหาสน์ตงฟางด้วยเจตนาใด แต่เห็นทีเขาคงได้ถอนหมั้นก่อนถึงกำหนด เพราะสาวน้อยผู้นี้กระมัง !",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201409/151695/542cc2fde603a_XXL.jpg?imgname=%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B8%8A%E0%B8%B2%E0%B8%A2%E0%B8%AB%E0%B8%A7%E0%B8%87%E0%B8%A3%E0%B8%B1%E0%B8%81",
        price : "118.15 บาท",  
      },
      {
        id: 10,
        name: "ยอดนางร้ายมืออาชีพ เล่ม 3",
        author : "กู้จื่อมู่",
        publisher : "Clover Book",
        category: "นิยายแปล นิยายแปลจีน",
        detail: "งานยากแค่ไหน ภารกิจมหาโหดระดับใด เมื่อถึงมือ อวี่ฉี แล้วอย่างไรก็ต้องสำเร็จทุกครั้งหลังจากภารกิจพิชิตใจเหล่าตัวร้าย อวี่ฉี ก็จะมีทั้งสกิลความสามารถที่เพิ่มขึ้น คราวนี้ได้อัปตำแหน่งเป็นถึงระดับหัวหน้าแผนก! นี่จึงเป็นที่มาของภารกิจพิชิตใจเหล่าตัวร้ายที่ไม่มีใครอยากทำและโยนมาที่หัวหน้า เพราะเหล่าตัวร้ายที่พิชิตนั้นทั้งร้ายกาจและไร้หัวใจจนเกินจะคาดเดา เพื่อให้บรรลุเป้าหมาย ต่อให้ต้องใช้ยุทธวิธีที่โหดเหี้ยมและเฉียบขาดขนาดไหน ฉวี่ก็ต้องทำ !",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/202004/502643/1000232164_front_XXL.jpg?imgname=%E0%B8%A2%E0%B8%AD%E0%B8%94%E0%B8%99%E0%B8%B2%E0%B8%87%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%A2%E0%B8%A1%E0%B8%B7%E0%B8%AD%E0%B8%AD%E0%B8%B2%E0%B8%8A%E0%B8%B5%E0%B8%9E-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-3",
        price : "365.50 บาท",  
      }
    ];
  


    this.bookscomic=[
      {
        id: 1,
        name: "ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน เล่ม 5 (Mg)",
        author : "คินุงาสะ โชโงะ",
        publisher : "PHOENIX-ฟีนิกซ์",
        category: "การ์ตูน การ์ตูนญี่ปุ่น มังงะ การ์ตูนไทย",
        detail: "โรงเรียนมัธยมปลายโคโดอิคุเซ โรงเรียนชั้นนำของประเทศที่ตอบสนองความปรารถนาในการศึกษาต่อ และการทำงานเกือบ 100 เปอร์เซ็นต์ มีสิ่งอำนวยความสะดวกทันสมัย พร้อมเครื่องใช้ที่ตอบสนองความบันเทิงครบครัน ทั้งยังให้อิสระกับทรงผมและการเลือกใช้ข้าวของส่วนตัว แถมยังมอบเบี้ยเลี้ยงเป็นแต้มที่มีมูลค่าเท่ากับ 100,000 เยนทุกเดือนอีกต่างหาก ช่างเป็นโรงเรียนที่เหมือนกับสวรรค์เสียนี่กระไร แล้วอายาโนะโคจิ คิโยทากะ ก็ได้เข้ามาเรียนที่นี่ ในโลกที่เป็นเหมือนกับความฝันแห่งนี้ วันหยุดฤดูร้อนมาเยือน การท่องเที่ยวล่องเรือสำราญสุดหรูที่ทางโรงเรียนจัดเตรียมไว้ให้เป็นเวลา 2 สัปดาห์ก็เริ่มต้นขึ้น แต่สิ่งที่รออยู่กลับเป็นบททดสอบเพื่อเอาชีวิตรอดบนเกาะร้าง นักเรียนสามารถซื้อวัตถุยังชีพด้วยแต้มที่ได้รับเพื่อการสอบเหล่าสมาชิกห้อง D พากันกระสับกระส่ายเพราะภายใต้เงื่อนไขที่ว่า แต้มที่เก็บรักษาไว้ได้จนสิ้นสุดการสอบจะเป็นประโยชน์ในการดำเนินชีวิตนักเรียนตั้งแต่ภาคเรียนที่ 2 เป็นต้นไป สภาพแวดล้อมที่ต่างจากปกติและปัญหาที่เข้ามาพร้อมกันไม่หยุดหย่อน...เหล่าสมาชิกห้องที่เริ่มแตกคอกันจะก้าวข้ามการสอบโหดหินครั้งนี้ไปได้อย่างไร คลื่นมรสุมแห่งหายนะที่ไม่เคยปรากฏมาก่อนจะเข้าถาโถมในเล่มที่ 5 นี้ !",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201811/246720/1000213849_front_XXL.jpg?imgname=%E0%B8%82%E0%B8%AD%E0%B8%95%E0%B9%89%E0%B8%AD%E0%B8%99%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%AA%E0%B8%B9%E0%B9%88%E0%B8%AB%E0%B9%89%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B8%99%E0%B8%99%E0%B8%B4%E0%B8%A2%E0%B8%A1-(%E0%B9%80%E0%B8%89%E0%B8%9E%E0%B8%B2%E0%B8%B0)-%E0%B8%A2%E0%B8%AD%E0%B8%94%E0%B8%84%E0%B8%99-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-5-(Mg)",
        price : "128.25 บาท",
      },
      {
        id: 2,
        name: "ขุนหลวงพระงั่ว กับจุดเริ่มต้นของราชวงศ์สุพรรณภูมิ",
        author : "พงษ์นาจ ,จิรวัฒน์และพีรพร หมื่นศรี",
        publisher : "E.Q. Plus",
        category: "การ์ตูน การ์ตูนความรู้ ประวัติศาสตร์",
        detail: "เรื่องราวชีวิตของ สมเด็จพระบรมราชาธิราชที่ 1 ผู้เป็นผู้ช่วยพระเจ้าอู่ทองสถานปนากรุงศรีอยุธยา เมื่อขึ้นเป็นกษัตริย์ก็ได้เจริญสัมพันธ์ไมตรีกับราชสำนักจีน โดยส่ง “พระนครอินทร์” เป็นราชฑูตจากกรุงศรีอยุธยาจนได้นำวิชาความรู้กลับมาผลิต “เครื่องสังคโลก” สินค้าเครื่องปั้นดินเผาขึ้นชื่อ ทว่าเมื่อสมเด็จพระบรมราชาธิราชที่ 1 สวรรคต ก็เกิดการแย่งชิงบัลกังค์ระหว่างราชวงศ์   อู่ทอง และ ราชวงศ์สุพรรณภูมิ สุดท้ายแล้วชัยชนะตกเป็นของราชวงศ์สุพรรณภูมิ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201703/210921/1000194893_front_XXL.jpg?imgname=%E0%B8%82%E0%B8%B8%E0%B8%99%E0%B8%AB%E0%B8%A5%E0%B8%A7%E0%B8%87%E0%B8%9E%E0%B8%A3%E0%B8%B0%E0%B8%87%E0%B8%B1%E0%B9%88%E0%B8%A7-%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B8%88%E0%B8%B8%E0%B8%94%E0%B9%80%E0%B8%A3%E0%B8%B4%E0%B9%88%E0%B8%A1%E0%B8%95%E0%B9%89%E0%B8%99%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B8%A3%E0%B8%B2%E0%B8%8A%E0%B8%A7%E0%B8%87%E0%B8%A8%E0%B9%8C%E0%B8%AA%E0%B8%B8%E0%B8%9E%E0%B8%A3%E0%B8%A3%E0%B8%93%E0%B8%A0%E0%B8%B9%E0%B8%A1%E0%B8%B4-",
        price : "160.55 บาท",
      },
      {
        id: 3,
        name: "PLANTS VS ZOMBIES ชุดไดโนเสาร์ ตอน ความลับของไดโนเสาร์",
        author : "Xiao Jiangnan",
        publisher : "เอ็มไอเอส,สนพ.",
        category: "การ์ตูน การ์ตูนความรู้ เสริมความรู้",
        detail: "PLANTS VS ZOMBIES ชุดไดโนเสาร์ ตอน ความลับของไดโนเสาร์ นับร้อยล้านปีก่อนในมหายุคมีโซโซอิกเคยมีไดโนเสาร์หลากหลายสายพันธุ์ดำรงชีวิตอยู่บนโลกใบนี้ ขอชวนน้องๆ ที่ชื่นชอบเหล่าไดโนเสาร์มาร่วมผจญภัยไปกับเหล่าพืชและซอบบี้ที่จะพาทุกคนไปไขปริศนาในโลกไดโนเสาร์ ทั้งสนุกสนาน เฮฮา และตื่นเต้นเร้าใจ เพื่อเปิดโลกให้น้องๆ ได้ทำความเข้าใจเจ้าสิ่งมีชีวิตมหัศจรรย์แห่งโลกดึกดำบรรพ์ และปลูกฝังให้รู้สึกรักในวิทยาศาสตร์ รู้จักการขวนขวายแสวงหาความรู้รอบตัว",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201910/491023/1000225339_front_XXL.jpg?imgname=PLANTS-VS-ZOMBIES-%E0%B8%8A%E0%B8%B8%E0%B8%94%E0%B9%84%E0%B8%94%E0%B9%82%E0%B8%99%E0%B9%80%E0%B8%AA%E0%B8%B2%E0%B8%A3%E0%B9%8C-%E0%B8%95%E0%B8%AD%E0%B8%99-%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%A5%E0%B8%B1%E0%B8%9A%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B9%84%E0%B8%94%E0%B9%82%E0%B8%99%E0%B9%80%E0%B8%AA%E0%B8%B2%E0%B8%A3%E0%B9%8C",
        price : "76.00 บาท",
      },
      {
        id: 4,
        name: "คิวพีโกะ! เทพธิดาป่วนรัก เล่ม 3",
        author : "Bungo Yamashita",
        publisher : "Siam Inter Comics",
        category: "การ์ตูน การ์ตูนญี่ปุ่น มังงะ การ์ตูนไทย",
        detail: "ฟุชิมัตซึคุง หนุ่มน้อยม.ปลายธรรมด้าธรรมดาที่ต้องใช้ชีวิตอย่างเหงาหงอยไม่เคยได้รับความสนใจจากหญิงสาวเพราะศรเหล็กกล้า (ลูกศรที่ทำให้เพศตรงข้ามเกลียดชัง) ของเทพธิดาแห่งความรัก คิวพีโกะเป็นเหตุ วันๆ ต้องฟันฝ่าอุปสรรคมากมายเพื่อแสดงถึงความรักข้างเดียวต่อยูมิจัง ในหลากหลายสถานที่...ทั้งไปทะเล ไปงานเทศกาลฤดูร้อน รวมถึงการเจาะเวลาหา อดีต แล้วผลลัพธ์ของการก้าวข้ามการเย้ายวนที่ชวนให้น้ำลายหก จะทำให้ความรักของฟุชิมัตซึก้าวหน้าขึ้น...หรือไม่!?",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/202001/498649/1000230115_front_XXL.jpg?imgname=%E0%B8%84%E0%B8%B4%E0%B8%A7%E0%B8%9E%E0%B8%B5%E0%B9%82%E0%B8%81%E0%B8%B0!-%E0%B9%80%E0%B8%97%E0%B8%9E%E0%B8%98%E0%B8%B4%E0%B8%94%E0%B8%B2%E0%B8%9B%E0%B9%88%E0%B8%A7%E0%B8%99%E0%B8%A3%E0%B8%B1%E0%B8%81-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-3",
        price : "57.00 บาท",
      },
      {
        id: 5,
        name: "Why? ฟิสิกส์",
        author : "Youngsun CHO",
        publisher : "นานมีบุ๊คส์",
        category: "การ์ตูน การ์ตูนความรู้ เสริมความรู้",
        detail: "ฟิสิกส์ คืออะไร เกี่ยวข้องกับเราอย่างไร หลายคนอาจร้อง “ยี้” และ “ส่ายหน้า” จนอาจไม่อยากเข้าใกล้ แต่รู้กันหรือเปล่าว่า จริงๆ แล้วฟิสิกส์อยู่รอบ ๆ ตัวเรา อยู่ในตัวเรา การเดินการวิ่ง ล้วนเกี่ยวข้องกับฟิสิกส์ หรือแม้กระทั่งในตอนนี้ที่น้องๆ กําลังอ่านหนังสือเล่มนี้ และได้ยินเสียงต่างๆ รอบตัว ก็ล้วนแต่เกี่ยวข้องกับฟิสิกส์ด้วย... Why? ฟิสิกส์ เล่มนี้จะพาทุกคนไปรู้จักกับฟิสิกส์ที่อยู่รอบๆ ตัวของเรา ไม่ว่าจะเป็นแรงและการเคลื่อนที่ ที่ทําให้เราเคลื่อนไหว วิ่ง เดิน หรือทําให้เครื่องบินลําใหญ่ ๆ ลอยอยู่บนท้องฟ้า พลังงาน ที่อยู่ในรูปแบบต่างๆ ไม่ว่าจะพลังงานความร้อน พลังงานแสง ไฟฟ้าและแม่เหล็ก ที่ช่วยให้ชีวิตของเราสะดวกสบายขึ้น คลื่นและแสง ที่ช่วยให้เรามองเห็นและได้ยิน รวมถึงการใช้ประโยชน์จากความรู้ที่ได้ในชีวิตประจําวัน Why? ฟิสิกส์ ยังมีประโยชน์ต่อการเรียนที่โรงเรียนอีกด้วย เนื่องจากมีเนื้อหาสอดคล้องกับกลุ่มสาระการเรียนรู้วิทยาศาสตร์ ถ้าพร้อมแล้ว เราเข้าไปผจญภัยในโลกแห่งฟิสิกส์กันเลย",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201808/241337/1000210958_front_XXL.jpg?imgname=Why?-%E0%B8%9F%E0%B8%B4%E0%B8%AA%E0%B8%B4%E0%B8%81%E0%B8%AA%E0%B9%8C",
        price : "117.60 บาท",
      },
      {
        id: 6,
        name: "เอาชีวิตรอดในโลก AI เล่ม 2",
        author : "Gomdori co.",
        publisher : "นานมีบุ๊คส์",
        category: "การ์ตูน การ์ตูนความรู้ วิทยาศาสตร์",
        detail: "อันตรายของระบบอันสมบูรณ์แบบในเมืองจำลอง! จีโอ จูโน และมินะถูกขังอยู่ในเมืองจำลองที่ AI เป็นผู้ครอบครอง! พวกเขาได้พบกับยูจิน เด็กหนุ่มอัจฉริยะที่หายตัวไปโดยบังเอิญ พวกเด็กๆ วางแผนการหลบหนีด้วยความช่วยเหลือของยูจิน แต่พวกเขาจะรอดพ้นจากเงื้อมมือ AI ที่แสนชาญฉลาดได้หรือไม่ ในเมื่อ AI เองก็เรียนรู้และพัฒนาความฉลาดขึ้นเรื่อยๆ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/202003/501805/1000231790_front_XXL.jpg?imgname=%E0%B9%80%E0%B8%AD%E0%B8%B2%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%B4%E0%B8%95%E0%B8%A3%E0%B8%AD%E0%B8%94%E0%B9%83%E0%B8%99%E0%B9%82%E0%B8%A5%E0%B8%81-AI-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-2",
        price : "115.50 บาท",
      },
      {
        id: 7,
        name: "แก๊งซ่าท้าทดลอง 38 ศึกประลองความเร็ว",
        author : "Story a.",
        publisher : "นานมีบุ๊คส์",
        category: "การ์ตูน การ์ตูนความรู้ เสริมความรู้",
        detail: "การแข่งขันรอบชิงระหว่างอังกฤษทีม B กับทีมแคนาดาถูกย้ายมาจัดขึ้นที่สนามแข่งกลางแจ้งริมทะเลสาบท่ามกลางลมที่พัดแรง เพื่อแข่งขันวัดอัตราเร็วของลมทั้ง 2 ทีมสร้างอุปกรณ์ทดลองที่แตกต่างกันอย่างสิ้นเชิง และต้องเผชิญกับกติการอบ 2 สุดระทึก ด้านชมรมการทดลองโรงเรียนเป็นหนึ่งกำลังฝึกครั้งสุดท้ายก่อนแข่งเพื่อให้ ฮารุ สมาชิกใหม่เข้ากับสมาชิกในทีมได้ดีขึ้น พวกเขาฝึกทดลองในหัวข้ออัตราเร็วและค้นพบความสามารถที่ซ่อนอยู่ของฮารุ แต่เรื่องราวกลับวุ่นวายก่อนแข่งขันเมื่อ เจวอน ประสบอุบัติเหตุ ฮารุจึงอาสาช่วยเพื่อน เธอจะทำสำเร็จและกลับมาทันการแข่งขันครั้งแรกของเธอหรือไม่ มาลุ้นกัน แก็งซ่าท้าทดลอง 38 ศึกประลองความเร็ว จะพาเราไปลุ้นระทึกกับความเร็วที่จะตัดสินผู้แพ้ชนะในชั่วพริบตา!",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201912/496135/1000228622_front_XXL.jpg?imgname=%E0%B9%81%E0%B8%81%E0%B9%8A%E0%B8%87%E0%B8%8B%E0%B9%88%E0%B8%B2%E0%B8%97%E0%B9%89%E0%B8%B2%E0%B8%97%E0%B8%94%E0%B8%A5%E0%B8%AD%E0%B8%87-38-%E0%B8%A8%E0%B8%B6%E0%B8%81%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B9%80%E0%B8%A3%E0%B9%87%E0%B8%A7",
        price : "165.50 บาท",
      },
      {
        id: 8,
        name: "ตะลุยดินแดนช็อกโกแลต",
        author : "BooksMaker",
        publisher : "Books Maker",
        category: "การ์ตูน การ์ตูนความรู้ เสริมความรู้",
        detail: "เหล่าสาวช็อกโกแลต และผู้รักของหวานทุกชนิด จะต้องไม่พลาด เรื่องราวความอร่อยของช็อกโกแลตที่อยู่เคียงคู่หน้าประวัติศาสตร์มนุษย์โลกมากกว่า 3,000 ปี จาก...เครื่องดื่มที่ได้รับการยกย่องว่าเป็นของขวัญจากเทพเจ้า ที่คนธรรมดาทั่วไปหากินไม่ได้ มีให้เฉพาะขุนนางและราชวงศ์เท่านั้น มาสู่...ขนมหวานที่ใครๆ ก็หาซื้อได้ง่ายๆ จาก...น้ำช็อกโกแลตผสมพริกสุดขม ไปสู่...ขนมหวานแสนอร่อยหลากชนิด พี่ฟ็อกซ์กี้จะพาทุกคนเดินไปบนเส้นทางช็อกโกแลตกับแก๊ง 4 แสบที่จะมาป่วนโลกช็อกโกแลตกันเลย",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201810/244388/1000212931_front_XXL.jpg?imgname=%E0%B8%95%E0%B8%B0%E0%B8%A5%E0%B8%B8%E0%B8%A2%E0%B8%94%E0%B8%B4%E0%B8%99%E0%B9%81%E0%B8%94%E0%B8%99%E0%B8%8A%E0%B9%87%E0%B8%AD%E0%B8%81%E0%B9%82%E0%B8%81%E0%B9%81%E0%B8%A5%E0%B8%95",
        price : "65.55 บาท",
      },
      {
        id: 9,
        name: "คุกกี้รันเอาชีวิตรอด เล่ม 8 : ในหุบเขา",
        author : "Mr. K",
        publisher : "นานมีบุ๊คส์",
        category: "การ์ตูน การ์ตูนความรู้ เสริมความรู้",
        detail: "เมื่อแม่มดร่ายเวทมนตร์ย้อนเวลา เหล่าคุกกี้ก็ค่อยๆ สลายร่างไปทีละคน เพื่อรักษาชีวิตของเหล่าคุกกี้ คุกกี้ผู้กล้าหาญและผองเพื่อนจึงออกเดินทางตามหาวัตถุดิบเวทมนตร์ แก๊งคุกกี้รันเอาชีวิตรอดจากป่าดิบ มหาสมุทร เมืองใหญ่ แดนหิมะ ไฟไหม้ถ้ำ และธารน้ำแข็งได้สำเร็จ พวกเขาจึงออกผจญภัยเพื่อปกป้องอาณาจักรคุกกี้ต่อไปแก๊งคุกกี้รันช่วยกันตามหาคุกกี้นางฟ้าทะเล คุกกี้เพียงคนเดียวที่รู้วิธีไปเมืองของพ่อมดที่ถูกลืม แต่เมื่อได้พบเธอ เหตุการณ์กลับไม่เป็นไปอย่างที่คาดคิด คุกกี้ผู้กล้าหาญได้รับพลังพิเศษโดยไม่ทันตั้งตัว และเหล่าคุกกี้รันต้องบุกไปยังหุบเขามังกร สถานที่ที่แม้แต่มังกรแดงยังไม่กล้าเฉียดใกล้ เพื่อช่วยคุกกี้แสงจันทร์และคุกกี้ภูตอัคคีจากพ่อมดแห่งความมืด เหล่าคุกกี้จะฟันฝ่าอุปสรรคไปได้หรือไม่ คุกกี้รันเอาชีวิตรอด 8 ในหุบเขา ได้บอกเล่าความรู้วิทยาศาสตร์น่ารู้ที่จะช่วยให้ใช้ชีวิตอย่างปลอดภัย ไม่ว่าจะเป็นวิธีขี่จักรยานอย่างปลอดภัย วิธีเคลื่อนย้ายผู้ได้รับบาดเจ็บ การปฐมพยาบาลเมื่อเลือดกำเดาไหล วิธีเอาตัวรอดเมื่อเผชิญสุนัขดุ ความรู้เรื่องการนอนหลับ และป้ายจราจรที่ควรรู้ นอกจากนี้ยังมีความรู้ใหม่ๆ ที่รอพวกเราไปเรียนรู้ด้วยนะ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201902/473474/1000216069_front_XXL.jpg?imgname=%E0%B8%84%E0%B8%B8%E0%B8%81%E0%B8%81%E0%B8%B5%E0%B9%89%E0%B8%A3%E0%B8%B1%E0%B8%99%E0%B9%80%E0%B8%AD%E0%B8%B2%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%B4%E0%B8%95%E0%B8%A3%E0%B8%AD%E0%B8%94-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-8-:-%E0%B9%83%E0%B8%99%E0%B8%AB%E0%B8%B8%E0%B8%9A%E0%B9%80%E0%B8%82%E0%B8%B2",
        price : "110.60 บาท",
      },
      {
        id: 10,
        name: "บันทึกสงครามของยัยเผด็จการ เล่ม 1 (Mg)",
        author : "จิกะ โทโจ",
        publisher : "PHOENIX-ฟีนิกซ์",
        category: "การ์ตูน การ์ตูนญี่ปุ่น มังงะ การ์ตูนไทย",
        detail: "ทาเนีย เดเกรชาฟฟ์ เด็กหญิงผมสีทอง ตาสีฟ้า เดิมคือมนุษย์เงินเดือนญี่ปุ่นรุ่นลุงที่ถูกผู้ลึกลับ x ส่งมาเกิดใหม่ท่ามกลางสงครามอันร้อนระอุรอบชายแดนจักรวรรดิ เพื่อฟื้นฟูศรัทธาของมนุษย์ที่มีต่อพระเจ้า ด้วยพลังเวทและความสามารถในการวิเคราะห์เหนือผู้ใหญ่คนไหนๆทำให้ทาเนียโดดเด่นในฐานะนายทหารจนได้รับเหรียญเชิดชูเกียรติที่น้อยคนนักจะได้ครองยามมีชีวิตอยู่ และเธอจะไม่หยุดยั้งในการก้าวสู่เส้นทางชนชั้นนำในกองทัพ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201710/224175/1000201517_front_XXL.jpg?imgname=%E0%B8%9A%E0%B8%B1%E0%B8%99%E0%B8%97%E0%B8%B6%E0%B8%81%E0%B8%AA%E0%B8%87%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B8%A1%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B8%A2%E0%B8%B1%E0%B8%A2%E0%B9%80%E0%B8%9C%E0%B8%94%E0%B9%87%E0%B8%88%E0%B8%81%E0%B8%B2%E0%B8%A3-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-1-(Mg)",
        price : "109.25 บาท",
      },
    ];



    this.yunovelbook=[
      {
        id: 1,
        name: "Why R U เพราะรักใช่เปล่า#ไฟท์เตอร์ติวเตอ",
        author : "CandyOn",
        publisher : "SENSE BOOK (เซ้นส์)",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "เมื่อซนชายหนุ่มผู้ที่ไม่อินกับนิยายวายได้ไปสาบานกับซอลน้องสาวตัวเองที่เขียนนิยายวาย ทำให้เรื่องวุ่นวายจึงเกิดขึ้นกับตัวเองกับคนที่ไม่ชอบหน้าอย่างสายฟ้า และยิ่งไปกว่านั้นทำให้ติวเตอร์และไฟท์เตอร์ที่เป็นอริกันมีโมเมนต์ร่วมกันอีกด้วย เหตุการณ์ต่อไปจะเป็นยังไง",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/202003/502191/1000232004_front_XXL.jpg?imgname=Why-R-U-%E0%B9%80%E0%B8%9E%E0%B8%A3%E0%B8%B2%E0%B8%B0%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B9%83%E0%B8%8A%E0%B9%88%E0%B9%80%E0%B8%9B%E0%B8%A5%E0%B9%88%E0%B8%B2-%E0%B9%84%E0%B8%9F%E0%B8%97%E0%B9%8C%E0%B9%80%E0%B8%95%E0%B8%AD%E0%B8%A3%E0%B9%8C%E0%B8%95%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%95%E0%B8%AD",
        price : "296.00 บาท",
      },
      {
        id: 2,
        name: "กลรักกุนซือกำมะลอ ภาคต้น",
        author : "Ling Bao Zhi (หลิงเป้าจือ)",
        publisher : "บงกช พับลิชชิ่ง",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "กงซุนจ่างซุนข้ามมิติไปเป็นกุนซือของตัวประกอบในหนังสือนิยายที่เขาเคยอ่านแม้ว่าเขาจะหลงใหลได้ปลื้มในใบหน้าอันหล่อเหลาเกินธรรมดาของพระเอก.....เทพเจ้าแห่งสงครามล่อหยี่เฟิง แต่เขาก็ทำได้เพียงเสียใจจนน้ำตาอาบแก้มเพราะว่าพวกเขาอยู่คนละฝ่ายกันวันนี้เขาตกเป็นเชลยของล่อหยี่เฟิง ในหัวเขาถึงต้องคิดหาทางรอด.... เพื่อการนี้เขาจึงต้องล่อหยี่เฟิงเข้าใจผิดว่าในมือเขามีสมบัติของราชวงศ์ก่อน จากนั้นก็แกล้งทำเป็นความจำเสื่อมแล้วนับญาติกับล่อหยี่เฟิง ให้คนแซ่ล่อจำต้องเลี้ยงเขาไว้เพื่อค่อยๆ หลอกถามที่ตั้งสมบัติเขามองดูล่อหยี่เฟิงที่ต้องแสร้งแสดงความห่วงใยและลดตัวลงมาช่วยดูแลบาดแผลของเขา หรือในยามที่เขาเจอโจร ล่อหยี่เฟิง ก็ยื่นมือช่วยเหลือและปลอบใจ ในใจเขาเต็มไปด้วยความสุข....เอ๋ เดี๋ยวก่อน!ตรวจสอบว่าข้าบาดเจ็บหรือไม่ก็ตรวจไปสิ เหตุใดต้องแก้ผ้าข้า แล้วนั่นท่านกำลังจับอะไร? หมอนี่ไม่สนใจในตัวบุรุษ แล้วตอนนี้ที่กำลังลวนลามอยู่คืออะไรกัน?!",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201702/210149/1000194323_front_XXL.jpg?imgname=%E0%B8%81%E0%B8%A5%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%81%E0%B8%B8%E0%B8%99%E0%B8%8B%E0%B8%B7%E0%B8%AD%E0%B8%81%E0%B8%B3%E0%B8%A1%E0%B8%B0%E0%B8%A5%E0%B8%AD-%E0%B8%A0%E0%B8%B2%E0%B8%84%E0%B8%95%E0%B9%89%E0%B8%99",
        price : "209.00 บาท",
      },
      {
        id: 3,
        name: "Absolute Zero องศาสูญ",
        author : "สลิล",
        publisher : "Movel Partner",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "เป็นองศาที่สูญสิ้นระยะอนันต์เมื่อจุดเริ่มต้นของความสัมพันธ์ คือจุดสิ้นสุดของการจากลา เราพบกันเพื่อพลัดพราก จากกันเพื่อถวิลหา นาฬิกาของคุณเดินต่อไปข้างหน้า ขณะที่นาฬิกาของผมตายไปนานแล้ว และถ้าเลือกได้ ผมขอให้คุณไม่เจ็บปวด แม้นั่นอาจหมายความว่า เราจะไม่เคยรู้จักกันเลยก็ตาม...",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201810/243634/1000212443_front_XXL.jpg?imgname=Absolute-Zero-%E0%B8%AD%E0%B8%87%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%B9%E0%B8%8D",
        price : "470.25 บาท",
      },
      {
        id: 4,
        name: "My Brother อย่าอ้อนนัก พี่รักไม่ไหว",
        author : "SunDear",
        publisher : "บ้านวายบุ๊ค",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "จู่ๆ ชีวิตสันโดษแสนหรรษาของผม ธันวาก็เป็นอันพังทลายลงในพริบตา เมื่อได้รับคำสั่งสายฟ้าแลบจากพ่อว่าจะส่งน้องชายมาให้ผมดูแล ซึ่งน้องชายที่ว่านั่นก็คือ จุนเด็กญี่ปุ่นร่างเล็ก ลูกติดภรรยาใหม่ของพ่อ แวบแรกที่ได้ยินว่าจะมีน้องชายมาอยู่ด้วย ผมก็เกลียดเจ้าตัวภาระนั่นเหลือเกิน รู้สึกเหมือนหมอนั่นเป็นมารที่จะมาทำลายความสุขของผม แต่พอได้เจอใบหน้าที่น่ารักจิ้มลิ้ม ได้สบกับแววตาหวานเยิ้มที่ออดอ้อน ได้เห็นแผ่นหลังเปลือยเปล่านวลเนียน หัวใจที่เต้นแรงมันก็แปรเปลี่ยนความรู้สึกเกลียด กลายเป็นความกลัว...กลัวว่าการใกล้ชิดเด็กนี่ อาจจะทำให้ผมหน้ามืดจนเผลอปล้ำน้องชายตัวเองเข้าสักวัน!",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201902/251159/1000215835_front_XXL.jpg?imgname=My-Brother-%E0%B8%AD%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%AD%E0%B9%89%E0%B8%AD%E0%B8%99%E0%B8%99%E0%B8%B1%E0%B8%81-%E0%B8%9E%E0%B8%B5%E0%B9%88%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B9%84%E0%B8%AB%E0%B8%A7",
        price : "285.00 บาท",
      },
      {
        id: 5,
        name: "LOSTING JUNGLE เลือนรักทรชน เล่ม 2",
        author : "กองบรรณาธิการ",
        publisher : "รักคุณ Rainbow",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "ลู่เจ๋อโจวบังเอิญพบเข้ากับชายคนหนึ่งที่บอกว่าเขางดงามราวกับตุ๊กตากระเบื้องเคลือบในงานปาร์ตี้ แรกเริ่มลู่เจ๋อโจวเพียงแต่อยากกลั่นแกล้ง และให้อีกฝ่ายเลิกยุ่งกับตัวเองเพียงเท่านั้น แต่หารู้ไม่ว่าเขากำลังยื่นมือเข้าไปเล่นกับไฟด้วยโทสะและสัญชาตญาณสัตว์ป่าของลู่เจ๋อเฉินทำให้เขาตัดสินใจทำเรื่องเลวร้ายต่ดมอร์รอสลงไปอย่างไม่ทันได้ไตร่ตรอง จนนำมาซึ่งปัญหาใหญ่เรื้อรังต่อจากนั้น ลู่เจ๋อโจวถูกจับตัวไป ก่อนที่ถังหลินเฟยที่ตามไปช่วยนั้นจะถูกกักตัวไว้ด้วยเสียเอง คนทั้งสองตกอยู่ในอันตรายอย่างใหญ่หลวง ลู่เจ๋อเฉินจะทำอย่างไร เมื่อคนหนึ่งก็เป็นคนรักส่วนอีกคนหนึ่งก็คือน้องชายคุณจะไม่ร้องขอชีวิตกับผมหน่อยเหรอลู่",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201911/493605/1000227119_front_XXL.jpg?imgname=LOSTING-JUNGLE-%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%99%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%97%E0%B8%A3%E0%B8%8A%E0%B8%99-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-2",
        price : "209.00 บาท",
      },
      {
        id: 6,
        name: "ALL IN ทั้งหมดใจ",
        author : "mysecretlove",
        publisher : "Hermit Books เฮอร์มิ",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "พีทสจ๊วตหนุ่มผู้ใช้ชีวิตเรียบเรื่อยกับอาชีพ และชีวิตประจำวันของตัวเอง กลับมีเหตุการณ์ที่ต้องเข้าไปพัวพันกับเรื่องรักๆ ใคร่ๆ ของเด็กมหาวิทยาลัย ...คิว เด็กหนุ่มปีสามกำลังสะบั้นรักคู่ขาคนล่าสุด เห็นพีทนั่งอยู่ก็ถูกใจ จึงดึงอีกคนเข้ามาอยู่ในเหตุการณ์ชุลมุนนี้ การพบเจอกันอย่างกะทันหัน และความรักที่เกิดขึ้นอย่างไม่ทันตั้งตัว เมื่อคนหนึ่งไม่เคยมีความรัก และอีกคนที่ไม่เคยลืมความรักในครั้งอดีต ในเมื่อไม่มีอะไรจะเสียก็ขอทุ่มไปทั้งหมดใจเลยแล้วกัน",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201902/473918/1000216276_front_XXL.jpg?imgname=ALL-IN-%E0%B8%97%E0%B8%B1%E0%B9%89%E0%B8%87%E0%B8%AB%E0%B8%A1%E0%B8%94%E0%B9%83%E0%B8%88",
        price : "332.50 บาท",
      },
      {
        id: 7,
        name: "คิดเล่น เป็นรัก",
        author : "Nikkou",
        publisher : "Deep",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "ตินตินผู้น่ารัก อุตส่าห์ทุ่มสุดตัว คอสเดรสแต่งหญิง เพื่อเรียกเรตติ้งให้แก่ทีมกีฬา E-sports จนโด่งดังปังเว่อร์ แต่ไหงวันดีคืนร้ายกลับถูกกัปตันทีมเขี่ยทิ้งอย่างไม่ไยดี ด้วยข้อหาสุดย้อนแย้งว่า เลยวัยน่ารัก และถูกรุมจีบเยอะเกิ๊น! แค้น! แค้น! แค้น! แค้นนี้ต้องชำระ (ด้วยสายฉีดแรงดันสูง) น้องตินจึงฟอร์มทีมนักกีฬาอีสเปอร์ตของตัวเองขึ้นมาใหม่ โดยหมายตา ปกปราชญ์ รุ่นพี่ปีสามสุดหล่อ ผู้มีนิ้วไฮสปิดติดเทอร์โบ หวังโค่นทีมเก่าให้ตกเก้าอี้จมดิน ความพยาบาทเป็นของหวาน ที่น้องตินกำลังลิ้มลอง! ผมหนีพี่ปกแบบไม่คิดชีวิต พอกลับมาถึงหอก็ทรุดตัวลงหน้าประตู แค่คิดว่าหลังจากนี้จะเข้าไปน้วยพี่เขาไม่ได้อีกต่อไป ก็แทบร้องไห้ออกมาทั้งอย่างนั้น งือ.. พี่ปกของน้องบ น้องกลับไปหาพี่ไม่ได้อีกแล้ว เพราะน้องรู้สึกกับพี่มากกว่าแค่พี่น้องกันผมนั่งกอดเข่าเศร้าซึมอยู่หน้าประตูนานหลายนาที กว่าจะมีกะจิตกะใจขยับตัวก็มีเสียงเคาะประตูดังขึ้น ขอเข้าไปได้มั้ย ผมจะปฏิเสธพี่ได้ยังไง เคยได้ยินคำว่า ยอมตั้งแต่หน้าประตู มั้ย!?",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201808/239480/1000209724_front_XXL.jpg?imgname=%E0%B8%84%E0%B8%B4%E0%B8%94%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%99-%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B8%A3%E0%B8%B1%E0%B8%81",
        price : "313.50 บาท",
      },
      {
        id: 8,
        name: "Mr.Feeding สามีน่ะเหรอ...อ๋อ! เดี๋ยวฝึกให้เชื่อง",
        author : "ราชานกฮูก",
        publisher : "ราชานกฮูก",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "ชื่อผมคือ 'นิกกี้' มารู้เอาอีกที ว่าได้มาจากหมาตัวที่ช่วยชีวิตแม่ผมเอาไว้...พออายุเข้า 18 ผมก็พบว่า ตัวเองสามารถพูดคุยฉอเลาะกับสัตว์ได้ดังนั้นเรื่องโครตจะวุ่น จึงเกิดขึ้นกับผมทั้งโดนแมลงสาบทำตัวเป็นพ่อบ้าน พอทำงานพิเศษที่ร้านก็เจอหนูท่อขู่ฟ้องศาลเดินเข้ามหา'ลัย ก็ต้องยกมือไหว้แมว ไม่งั้นจะโดนอ้อน จนต้องร้องขอชีวิตแต่ดีหน่อยนึง คือมีไซบีเรียนสามตัว ช่วยทำมาหากินที่ร้านขายอาหารสัตว์ด้วยความที่คิดเสมอ ว่าจิตใจดีเหมือนเบ้าหน้า ส่วนฐานะกลับตรงกันข้ามผมเลยต้องพยายาม ใช้ชีวิตอย่างมีระดับ... ระดับรากหญ้า ทำงานหามรุ่งหามค่ำ ทว่า... ตัวปัญหาที่มีนามว่า 'สิริ' ก็เข้ามาในหัวใจ ซ้ำแล้ว ผมยังโดน 'เจ๊จิ้ง' จิ้งจก เจ้าแม่ เสี้ยมให้จับสิริทำสามีอีกตั้งแต่นั้นเป็นต้นมา อีนิกกี้ ที่เป็นคนไม่ใช่หมาก็มีแต่ความบัดสีเข้ามาในชีวิต...",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201803/230561/1000205206_front_XXL.jpg?imgname=Mr.Feeding-%E0%B8%AA%E0%B8%B2%E0%B8%A1%E0%B8%B5%E0%B8%99%E0%B9%88%E0%B8%B0%E0%B9%80%E0%B8%AB%E0%B8%A3%E0%B8%AD...%E0%B8%AD%E0%B9%8B%E0%B8%AD!-%E0%B9%80%E0%B8%94%E0%B8%B5%E0%B9%8B%E0%B8%A2%E0%B8%A7%E0%B8%9D%E0%B8%B6%E0%B8%81%E0%B9%83%E0%B8%AB%E0%B9%89%E0%B9%80%E0%B8%8A%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87",
        price : "456.00 บาท",
      },
      {
        id: 9,
        name: "จรกาคนงาม (2 เล่มจบ)",
        author : "หนูแดงตัวน้อย",
        publisher : "รักคุณ",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "เล่ม 1 รูปก็ชั่ว ตัวก็ดำ นามก็ไม่เพราะ อีกทั้งเป็นเพียงเจ้าเมืองเล็กๆ ศักดินาต้อยต่ำ จึงต้องสูญเสียนางอันเป็นที่รักไปให้กับศัตรูหัวใจ มิหนำซ้ำยังถูกตราหน้าว่าเป็น ‘ตัวร้าย’ อีก ‘จรกา’ ผูกใจเจ็บมาตั้งแต่ชาติก่อน เมื่อเกิดใหม่ในชาตินี้เป็น ‘จิระ’ หนุ่มน้อยรูปงาม นามเพราะ เสน่ห์เหลือร้าย เขาจึงได้รับพรให้ระลึกถึงผู้เป็นที่รักในอดีตได้เพื่อครองคู่กับนางบุษบาในชาตินี้ แต่ทว่า...ดูเหมือนสวรรค์จะไม่เมตตาเขาถึงที่สุดสักเท่าไร เพราะนอกจากจะส่งเขากับบุษบามาเกิดแล้ว ยังส่งเจ้าตัวร้ายอย่าง ‘อิเหนา’ มาในคราบเดือนมหาวิทยาลัยอย่าง ‘อินทรา’ ด้วย จะจองเวรจองกรรมกันมากเกินไปแล้ว! ไม่รู้ล่ะ ไม่ว่ายังไงชาตินี้เขาก็ต้องได้ครองนางบุษบาให้จงได้! เล่ม 2 ทั้งที่ตั้งใจว่าชาตินี้ ไม่ว่าอย่างไรก็จะครองคู่กับบุษบาให้จงได้ แต่ไหงกามเทพถึงเล่นตลก ร้อยดวงใจของ ‘จรกา’ อย่าง ‘จิระ’ ให้คล้องรัดกับ ‘อิเหนา’ ที่ชาติใหม่คือ ‘อินทรา’ กันล่ะ ความรักที่ขัดกับคำสาบานในชาติที่แล้ว ก่อเกิดสารพัดปัญหาตามมา แล้วไหนจะการปรากฏตัวของ ‘จินตะหราวาตี’ ผู้ที่ได้ชื่อว่าเป็น ‘เมีย’ คนแรกของอิเหนาที่มาทวงถามความยุติธรรมให้ตัวเองอีก เห็นทีความรักระหว่างอิเหนาและระตูจรกาในชาตินี้จะไม่ง่ายอย่างที่คาดคิดไว้เสียแล้ว",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201811/247668/1000214218_front_XXL.jpg?imgname=%E0%B8%88%E0%B8%A3%E0%B8%81%E0%B8%B2%E0%B8%84%E0%B8%99%E0%B8%87%E0%B8%B2%E0%B8%A1-(2-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1%E0%B8%88%E0%B8%9A)",
        price : "646.00 บาท",
      },
      {
        id: 10,
        name: "เฮเดส",
        author : "ชุนภุศ",
        publisher : "นาบู",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "อายุสิบหกปี เจ้าชายเฮเดส ทรงซื้อตัวเด็กชายอายุแปดขวบมาจากลานประมูลทาส  อายุยี่สิบสองปี องค์รัชทายาทหนุ่มโปรดให้เขาในวัยสิบสี่เข้าถวาย สิบปีต่อมา  พระองค์จะทรงอภิเษกสมรสกับเจ้าหญิงต่างแคว้น ทว่าสิ่งที่ธามถวายให้ไปไม่ใช่แค่ร่างกาย เจ้าชายเฮเดสไม่เคยรับสั่งบอกว่าพระองค์ทรงรู้สึกอย่างไรกับเขา แต่ในฐานะมหาดเล็กที่ถวายงานใกล้ชิด ธาม รู้ว่าพระองค์ทรงมีเขาเพียงคนเดียวมาตลอดสิบปี ประโยคเดียวที่เขาอยากทูลถามก่อนวันอภิเษกสมรสจะมาถึงก็คือ ...ฝ่าบาท 'เคยรัก' กระหม่อมบ้างรึเปล่า",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201608/198938/1000188891_front_XXL.jpg?imgname=%E0%B9%80%E0%B8%AE%E0%B9%80%E0%B8%94%E0%B8%AA",
        price : "322.05 บาท",
      },
      {
        id: 11,
        name: "คลื่นใต้น้ำ",
        author : "huskyhund",
        publisher : "ไฮยาซินธ์",
        category: "นิยายวาย นิยายยูริ นิยายวาย นิยายยูริ",
        detail: "ถ้าเผลอใจรักเพื่อนสนิท ทุกอย่างจะเหมือนเดิมไหม...นี่คือความกังวลของ ตั้งใจ กับ ใบตอง...สองหนุ่มเพื่อนซี้ที่คบกันมาตั้งแต่สมัยนุ่งกางเกงขาสั้นชนขนหน้าแข้งกันตอนเริ่มแตกเนื้อหนุ่ม โดยที่ทั้งคู่ไม่รู้เลยว่าอีกฝ่ายนั้นรู้สึกเช่นเดียวกัน เมื่อใบตองเริ่มรู้ใจตัวเอง เขาตัดสินใจไปเรียนต่อไกลคนละทวีป เผื่อความห่างไกลจะทำให้จัดการความรู้สึกที่เปลี่ยนไปนี้ได้ เขาจึงมุ่งหน้าไปตามหาหัวใจ โดยมีเพื่อนพ้องในกลุ่มที่เมืองไทยและเพื่อนใหม่คอยป่วนไม่เว้นแต่ละวัน มีแต่เรื่องเข้าใจผิดกันไม่จบไม่สิ้น กว่าจะลงตัวทุกเรื่องก็ทำเอาทั้งคู่แทบหมดแรง พอรู้ว่าใจตรงกันแล้วก็ยังไม่หมดปัญหา เพราะไม่รู้ว่าใครจะ รุก ใครจะ รับ มีแต่รักแล้วก็อยากจะรุก แต่นี่ต่างฝ่ายต่างแย่งกันเป็นฝ่ายรับ แล้วอย่างนี้ความสัมพันธ์ของพวกเขาจะคืบหน้าไปไกลกว่าเดิมเมื่อไรเล่า!",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201801/227858/1000203725_front_XXL.jpg?imgname=%E0%B8%84%E0%B8%A5%E0%B8%B7%E0%B9%88%E0%B8%99%E0%B9%83%E0%B8%95%E0%B9%89%E0%B8%99%E0%B9%89%E0%B8%B3",
        price : "437.00 บาท",
      },
    ];


    this.literaturebooks=[
      {
        id: 1,
        name: "ชุด All Thai Favourite",
        author : "รวมนักเขียน",
        publisher : "แพรวเยาวชน",
        category: "วรรณกรรม วรรณกรรมเยาวชน",
        detail: "รายละเอียด : ชุด All Thai Favourite ชุด All Thai Favourite ประกอบด้วย - เด็กหญิงนางฟ้า (ปกแข็ง) - ส้มสีม่วง (ปกแข็ง) - ครุฑน้อย (ปกแข็ง) - เจ้าชายไม่วิเศษ (ปกแข็ง) - เด็กหญิงสวนกาแฟ (ปกแข็ง)",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201303/107558/1000140159_front_XXL.jpg?imgname=%E0%B8%8A%E0%B8%B8%E0%B8%94-All-Thai-Favourite",
        price : "859.50 บาท",
      },
      {
        id: 2,
        name: "กฎข้อนึง ของความสัมพันธ์",
        author : "คิดมาก",
        publisher : "Springbooks",
        category: "วรรณกรรม เรื่องสั้น",
        detail: "กฎข้อนึง ของความสัมพันธ์ ผลงานของนักเขียนในโลกออนไลน์ ที่ผู้ติดตามในทวิตเตอร์กว่า 1,700,000 คน ผู้เขียนหนังสือ ไม่เอาน่ะอย่าคิดมาก โตขึ้นจึงรู้ว่า คิดมากไปหรือเปล่า ฯลฯ ที่มียอดขายรวมมากกว่า 100,000 เล่มทุกอย่างเปลี่ยนแปลงเสมอ ไม่ว่าเราจะอยากให้มันเหมือนเดิมสักเท่าไหร่",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201809/242504/1000211619_front_XXL.jpg?imgname=%E0%B8%81%E0%B8%8E%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B8%99%E0%B8%B6%E0%B8%87-%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%AA%E0%B8%B1%E0%B8%A1%E0%B8%9E%E0%B8%B1%E0%B8%99%E0%B8%98%E0%B9%8C",
        price : "202.50 บาท",
      },
      {
        id: 3,
        name: "อาเซียนเขย่าโลก 70 บุคคลสำคัญอาเซียน",
        author : "ทสมล ชนาดิศัย,ดุสิต มูลสมบัติ",
        publisher : "อมรินทร์",
        category: "วรรณกรรม หนังสือคนดัง ประสบการณ์ชีวิต",
        detail: "เปิดชีวิตบุคคลสำคัญจากทั่วทุกมุมภูมิภาคอาเซียน ตั้งแต่อดีตจนถึงปัจจุบัน 70 บุคคลที่คัดสรรมาแล้วว่ามีความสำคัญ สามารถสร้างชื่อเสียงระบือไกลไปทั่วโลก สนุก ได้ความรู้ อบอวลไปด้วยแรงบันดาลใจ อ่านเอามันก็ได้ อ่านไว้เล่าต่อก็ดี อ่านเป็นข้อมูลทำรายงานก็ยิ่งดี ต้องเล่มนี้เท่านั้น!",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201407/144135/1000161958_front_XXL.jpg?imgname=%E0%B8%AD%E0%B8%B2%E0%B9%80%E0%B8%8B%E0%B8%B5%E0%B8%A2%E0%B8%99%E0%B9%80%E0%B8%82%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B9%82%E0%B8%A5%E0%B8%81-70-%E0%B8%9A%E0%B8%B8%E0%B8%84%E0%B8%84%E0%B8%A5%E0%B8%AA%E0%B8%B3%E0%B8%84%E0%B8%B1%E0%B8%8D%E0%B8%AD%E0%B8%B2%E0%B9%80%E0%B8%8B%E0%B8%B5%E0%B8%A2%E0%B8%99",
        price : "75.00 บาท",
      },
      {
        id: 4,
        name: "เพราะเราต่างเป็นเพลงเศร้าของใครคนหนึ่ง",
        author : "คุณ (ONCE)",
        publisher : "Springbooks",
        category: "วรรณกรรม เรื่องสั้น",
        detail: "ข้อความและเรื่องราวที่อ่านแล้วเจ็บ จุก จนกระแทกอย่างจัง แบ่งเป็น 2 Part Part 1: ทุกคนเคยมีโมเม้นต์ 24 ชม.หลังจากพบกับความผิดหวังที่ต้องก้าวผ่าน ซึ่งแน่นอนแต่ละชม.มันผ่านไปอย่างล่าช้า 1 2 3…จนชม.สุดท้ายเราก็พบเพียงพบว่า เขาคนนั้นไม่อยู่กับเราตรงนี้แล้วจริงๆ แล้วเราล่ะจะทำยังไงต่อไป Part 2: แน่นอนว่าทุกคนเคยเป็นหนึ่งในบทเพลงนั้นๆ ไม่ว่าจะเป็นเพลงที่สุข สนุกสนาน กระทั่งเพลงเศร้า ซึ่งน่าแปลกที่เวลาเป็นเพลงเศร้าใบหน้าของคนที่คิดถึงมันช่างแจ่มชัดกว่าเพลงไหนๆ ไม่มีสิ่งใดที่เกิดขึ้นแล้วไร้ประโยชน์ น้อยที่สุดก็ประสบการณ์ มากที่สุดก็ความเข้าใจ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201909/489511/1000224307_front_XXL.jpg?imgname=%E0%B9%80%E0%B8%9E%E0%B8%A3%E0%B8%B2%E0%B8%B0%E0%B9%80%E0%B8%A3%E0%B8%B2%E0%B8%95%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B9%80%E0%B8%9E%E0%B8%A5%E0%B8%87%E0%B9%80%E0%B8%A8%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B9%83%E0%B8%84%E0%B8%A3%E0%B8%84%E0%B8%99%E0%B8%AB%E0%B8%99%E0%B8%B6%E0%B9%88%E0%B8%87",
        price : "202.50 บาท",
      },
      {
        id: 5,
        name: "ความรักที่เบี่ยงเบน DEVIANT LOVE",
        author : "Sigmund Freud (ซิกมันด์ ฟรอยด์)",
        publisher : "สมิต",
        category: "วรรณกรรม เรื่องสั้น",
        detail: "ความรักระหว่างชายกับหญิงเป็นเรื่องปกติที่เราพบเจอ แต่เราก็มักพบความรักระหว่างชายกับชาย หรือหญิงกับหญิง ซึ่งเป็นเพศเดียวกันมากขึ้น ความรักเบี่ยงเบนจากความปกติได้อย่างไร สิ่งต่างๆ เหล่านี้ ฟรอยด์พยายามคิดและใช้ประสบการณ์ของเขาจากการดูแลคนไข้ทางจิตและอ่านงานเขียนและประสบการณ์ของนักจิตวิทยาท่านอื่น เพื่อนำมาประมวลผลเป็นความคิดรวบยอดของเขาอีกทีหนึ่งในเรื่อง ความรักที่เบี่ยงเบน นี้ ฟรอยด์ได้สรุปแนวคิดของเขาอย่างเป็นระบบและมีตัวอย่างเพื่ออธิบายให้เกิดความเข้าใจเพิ่มมากขึ้นซึ่งเหมาะสำหรับผู้ที่จะศึกษาแนวความคิดทางจิตวิทยาที่มีความซับซ้อนขึ้นมาอีกระดับหนึ่ง",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/202001/497446/1000229310_front_XXL.jpg?imgname=%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B9%80%E0%B8%9A%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87%E0%B9%80%E0%B8%9A%E0%B8%99-DEVIANT-LOVE",
        price : "152.00 บาท",
      },
      {
        id: 5,
        name: "ข้ามภพ ข้ามชาติ",
        author : "ครู ข้างวังฯ",
        publisher : "แพรวสำนักพิมพ์",
        category: "วรรณกรรม เรื่องสั้น",
        detail: "เรื่องจริงหรือนิยาย...คุณเท่านั้นที่จะรู้คำตอบ จากเรื่องดังในเฟซบุ๊กที่มีผู้ติดตามเกือบสามแสนคนข้ามภพ ข้ามชาติ เขียนขึ้นด้วยการนำสถานที่จริงและคนตริงมาเป็นฉากและตัวละคร โดยใช้ศิลปวัฒนธรรมท้องถิ่นมานำเสนอได้อย่างน่าสนใจและน่าติดตาม จนไม่รู้ว่าเป็นเรื่องจริงหรือเรื่องแต่ง - การะเกด",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201602/187505/1000182801_front_XXL.jpg?imgname=%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A1%E0%B8%A0%E0%B8%9E-%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A1%E0%B8%8A%E0%B8%B2%E0%B8%95%E0%B8%B4",
        price : "148.50 บาท",
      },
      {
        id: 6,
        name: "วันนี้จะเป็นวันที่ดี",
        author : "คิดมาก",
        publisher : "Springbooks",
        category: "วรรณกรรม เรื่องสั้น",
        detail: "สิ่งที่คนเรามีเท่ากัน คือเวลาในหนึ่งวัน ไม่มีใครมีมากกว่าใคร ไม่มีใครมีน้อยกว่าใคร เรามียี่สิบสี่ชั่วโมงเหมือนกัน สิ่งที่แตกต่างกัน คือความรู้สึกต่อช่วงเวลานั้น บางคนรู้สึกว่า วันหนึ่งวันนั้นช่างแสนสั้น บางคนรู้สึกว่า วันหนึ่งวันนั้นช่างยาวนาน แด่ วันที่ดี และวันที่ร้าย ที่สร้างความหมายให้กับชีวิต สิ่งหนึ่งที่เชื่อเสมอมา คือ พลังของการคิดดี พูดดี ทำดี มีอยู่จริง การคิดดีอาจไม่ได้ช่วยให้เกิดสิ่งดีๆ ขึ้นในชีวิตเราตลอด แต่ช่วยให้เราผ่านวันเวลาที่ไม่ดีไปได้การพูดดีช่วยให้เรามีกำลังใจ และส่งต่อกำลังใจให้คนอื่นส่วนการทำดีคือการทำเต็มที่แล้ว จึงไม่มีอะไรให้เสียใจหรือเสียดาย พรุ่งนี้เช้าเรื่องร้ายๆ ของวันนี้ จะกลายเป็นอดีต เวลาที่ใครบางคน ตกอยู่ในความเศร้ามากๆ สิ่งที่เขาทำ อาจไม่ใช่การพูดคำใด หรือการร้องไห้ หรือแสดงความเสียใจ แต่เขาเลือกที่จะเงียบ เงียบเพราะถ้อยคำใด หรือหยดน้ำตา ก็ไม่มากพอ ที่จะบรรยายความรู้สึกของเขาออกมา “ปัจจุบัน คือ ของขวัญที่เราได้รับในทุกวันที่ตื่นขึ้นมา” แด่ วันที่ดี และวันที่ร้าย ที่สร้างความหมายให้กับชีวิต",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201901/249273/1000214978_front_XXL.jpg?imgname=%E0%B8%A7%E0%B8%B1%E0%B8%99%E0%B8%99%E0%B8%B5%E0%B9%89%E0%B8%88%E0%B8%B0%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B8%A7%E0%B8%B1%E0%B8%99%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%94%E0%B8%B5-",
        price : "202.50 บาท",
      },
      {
        id: 7,
        name: "นิทานนำบุญ เรื่องของแถว",
        author : "นำบุญ นามเป็นบุญ",
        publisher : "สำนักพิมพ์มะลิ",
        category: "วรรณกรรม วรรณกรรมเยาวชน",
        detail: "โลกของเรามีนิทานอยู่มากมาย แต่นิทานของนักเขียนนิทานที่มีผลงานมากกว่า 400 เรื่อง และประสบการณ์กว่า 20 ปี อย่างพี่นำบุญ นามเป็นบุญ เป็นนิทานแสนวิเศษที่เต็มไปด้วยความปรารถนาดี ความตั้งใจที่จะมอบความสุขให้แก่เด็กและผู้อ่านทุกวัย นิทานนำบุญ เรื่องแมว ซึ่งรวบรวมและคัดสรร นิทานแมวถึง 10 เรื่อง ที่จะมาสร้างสนุก ความสุข ความประทับใจ รวมถึงให้ธรรมะและข้อคิดแก่ผู้อ่านหรือผู้ที่ได้ฟังด้วยนิทานทั้ง 10 เรื่อง นิทานนำบุญ เรื่องเล่าจากพี่นำบุญ นามเป็นบุญ สุดยอดนักเขียนนิทานจากหนังสือขวัญเรือนมากว่า 20 ปี ได้คัดกรองรวบรวมสุดยอดนิทานที่เกี่ยวกับ แมว รวมเล่มออกมาให้คุณหนู คุณพ่อ คุณแม่นักอ่านได้รับความสนุกสนานเพลิดเพลินพร้อมทั้งข้อคิดที่เป็นคติเตือนใจกึ่งธรรมะ ปราถนาดีมอบให้ผ่านเรื่องเล่าที่คัดสรรค์ด้วยความรักและความตั้งใจจากประสบการณ์ผลงานแต่งนิทานกว่า 20 ปีของพี่นำบุญ นามเป็นบุญ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201803/231295/1000205485_front_XXL.jpg?imgname=%E0%B8%99%E0%B8%B4%E0%B8%97%E0%B8%B2%E0%B8%99%E0%B8%99%E0%B8%B3%E0%B8%9A%E0%B8%B8%E0%B8%8D-%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B9%81%E0%B8%96%E0%B8%A7",
        price : "142.50 บาท",
      },
      {
        id: 8,
        name: "LOOK UP เงยหน้า สบตาดาว",
        author : "ปะการัง",
        publisher : "แพรวสำนักพิมพ์",
        category: "วรรณกรรม เรื่องสั้น",
        detail: "ผมเขียนถอยคำเหล่านี้ให้คุณก้มหน้าอ่าน แต่อย่าลืมพักสายตาด้วยการเงยหน้าสบตาบนท้องฟ้าบ้าง แล้วคุณจะรู้...ไม่ว่าชีวิตจะมืดมิดเพียงใด ยังมีความหวังเสมอ เหมือนแสงดาวบนท้องฟ้านั้น",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201410/154391/1000166017_front_XXL.jpg?imgname=LOOK-UP-%E0%B9%80%E0%B8%87%E0%B8%A2%E0%B8%AB%E0%B8%99%E0%B9%89%E0%B8%B2-%E0%B8%AA%E0%B8%9A%E0%B8%95%E0%B8%B2%E0%B8%94%E0%B8%B2%E0%B8%A7",
        price : "93.00 บาท",
      },
      {
        id: 9,
        name: "อีลอน มัสก์",
        author : "Ashley Vance",
        publisher : "Shortcut",
        category: "วรรณกรรม หนังสือคนดัง ประสบการณ์ชีวิต",
        detail: "อีลอน มักส์ ผู้ประกอบการธุรกิจที่น่าจับตามองที่สุดคนหนึ่งใน Silicon Valley ซึ่งมีอิทธิพลต่อการเปลี่ยนแปลงอุตสาหกรรมต่างๆ หลายด้าน อย่าง Paypal หนึ่งในบริษัทที่มีระบบการโอนเงิน Online ที่ใหญ่ที่สุดในโลก Tesla Motor บริษัทสร้างรถยนต์ไฟฟ้าแบบสปอร์ตและ SpaceX บริษัทเอกชนทางด้านธุรกิจการขนส่งทางอวกาศ ที่สนับสนุน เรื่องการสำรวจดาวอังคารและสนใจก่อตั้งโครงการ greenhouse บนดาวอังคาร   และเป็นแรงบันดาลใจของบท Tony Stark ในภาพยนต์ Iron Man ที่โด่งดังไปทั่วโลก ชายผู้นี้เติบโตมาในแอฟริกาใต้ที่ยากลำบาก แต่เขาส่ามารถก้าวขึ้นสู่จุดสูงสุดของผู้ประกอบการระดับโลกได้ หนังสือที่ได้รับความนิยม ขายดีติดอันดับ New York Times Bestseller เล่มนี้ จะพาคุณไปรู้จักกับ อีลอน มักส์ ผ่านเรื่องราวในชีวิตของเขา",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201807/238477/1000209140_front_XXL.jpg?imgname=%E0%B8%AD%E0%B8%B5%E0%B8%A5%E0%B8%AD%E0%B8%99-%E0%B8%A1%E0%B8%B1%E0%B8%AA%E0%B8%81%E0%B9%8C",
        price : "283.50 บาท",
      },
      {
        id: 10,
        name: "BLONOTE : โบลโน้ต",
        author : "Tablo",
        publisher : "ไจไจบุ๊คส์",
        category: "วรรณกรรม เรื่องสั้น",
        detail: "หนังสือเล่มนี้ไม่ใช่นวนิยาย ความเรียง หรือบทกวี เป็นเพียงถ้อยคำลงท้ายของทาโบลในรายการวิทยุยามดึก หากคุณกำลังรู้สึกโดดเดี่ยวและว่างเปล่า เพียงสุ่มเปิดหนังสือออกมาสักหน้า อาจพบจุดเริ่มต้นของแรงบันดาลใจ หรือทำให้ความทุกข์กังวลใจสิ้นสุด วางหนังสือเล่มนี้ไว้ใกล้มือ เผื่อช่วงเวลาใดที่หัวใจเกิดสั่นคลอน",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201812/248284/1000214544_front_XXL.jpg?imgname=BLONOTE-:-%E0%B9%82%E0%B8%9A%E0%B8%A5%E0%B9%82%E0%B8%99%E0%B9%89%E0%B8%95",
        price : "261.25 บาท",
      },
      {
        id: 11,
        name: "ปฏิบัติการพิเศษ Q 5 ระเบิดนิวเคลียร์สะท้านขวัญ",
        author : "เหลียงเคอชิง",
        publisher : "แพรวเยาวชน",
        category: "วรรณกรรม วรรณกรรมเยาวชน",
        detail: "ปฏิบัติการพิเศษ Q’ เป็นนวนิยายชุด (series) แนวแอ็กชั่นปนสืบสวนสอบสวนที่โด่งดังมากในประเทศฮ่องกง และมีผู้อ่านรุ่นเยาว์ติดตามเป็นจำนวนมาก แรกเริ่มนั้นตีพิมพ์เป็นตอนๆในนิตยสาร ก่อนจะนำมารวมเล่มเมื่อเกิดกระแสความนิยมอย่างแพร่หลาย ตัวละครของเรื่องมีชื่อว่า ‘วิง’ เป็นสายลับมือดีขององค์กรลับที่ก่อตั้งขึ้นโดยความร่วมมือของนานาประเทศ วิงนี้มีนิสัยสุขุม รอบคอบ จิตใจดี มีฝีมือเป็นเลิศ แต่ก็แฝงความเปิ่นเล็กน้อย สร้างความขบขันให้กับการไขคดีบางคดีได้อย่างเหลือเชื่อ อาศัยตัวละครและเนื้อเรื่องเหล่านี้เอง ที่ทำให้ ‘ปฏิบัติการพิเศษ Q’ สร้างความบันเทิงให้แก่นักอ่านรุ่นเยาว์มาแล้วทั่วทั้งเกาะฮ่องกง ในเล่ม 5 เป็นตอนสั้นหลายๆตอน แบ่งเป็น 4 ภารกิจใหญ่ คล้ายๆเล่ม 1ชื่อเล่มคือ ‘ระเบิดนิวเคลียร์สะท้านขวัญ’ภารกิจ I คลี่คลายความลับของคนตาย ภารกิจ II สัตว์ประหลาดสุดสยอง ภารกิจ III ไล่ล่าหาความจริง ภารกิจ IV สัญญาณมหันตภัย",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/2011/2009/7018213_250.jpg?imgname=%E0%B8%9B%E0%B8%8F%E0%B8%B4%E0%B8%9A%E0%B8%B1%E0%B8%95%E0%B8%B4%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%9E%E0%B8%B4%E0%B9%80%E0%B8%A8%E0%B8%A9-Q-5-%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%9A%E0%B8%B4%E0%B8%94%E0%B8%99%E0%B8%B4%E0%B8%A7%E0%B9%80%E0%B8%84%E0%B8%A5%E0%B8%B5%E0%B8%A2%E0%B8%A3%E0%B9%8C%E0%B8%AA%E0%B8%B0%E0%B8%97%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B8%82%E0%B8%A7%E0%B8%B1%E0%B8%8D",
        price : "85.50 บาท",
      },
    ];

    this.homebooks=[
      {
        id: 1,
        name: "รวม 120 บ้านชั้นเดียว",
        author : "วิชัย ชอบสุธน,บก.",
        publisher : "โฮมคอลเลคชั่นกรุ๊ป",
        category: "บ้านและสวน บ้านและสวน",
        detail: "หนังสือ รวม 120 บ้านชั้นเดียว เล่มนี้ นำเสนอแบบบ้านชั้นเดียวหลายขนาดและหลากสไตล์ หลายพื้นที่ใช้สอย พร้อมตอบคำถามคาใจสำหรับผู้อ่านที่ต้องการคำตอบเพื่อใช้ประกอบการตัดสินใจ สร้างบ้านหลังใหม่ ด้วยรูปเล่มเล็กกะทัดรัดสะดวกแก่การพกพา รวมทั้งภาพประกอบและแบบแปลนสีสันสวยงาม",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/200710/3295/1000054833_front_XXL.jpg?imgname=%E0%B8%A3%E0%B8%A7%E0%B8%A1-120-%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B8%8A%E0%B8%B1%E0%B9%89%E0%B8%99%E0%B9%80%E0%B8%94%E0%B8%B5%E0%B8%A2%E0%B8%A7",
        price : "304.00 บาท",
      },
      {
        id: 2,
        name: "ห้องน้ำ Bathroom Design & Ideas (ปกแข็ง)",
        author : "ภัทรสิริ อภิชิต",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "ห้องน้ำ Bathroom การออกแบบหนังสือปกแข็ง พิมพ์ด้วยกระดาษอาร์ตด้านสวยงามหรูหรา ที่รวบรวมไอเดียจากรูปภาพห้องน้ำดีไซน์ดีๆ ไว้มากมาย เพื่อให้ผู้อ่านสามารถนำไปปรับใช้และวาดฝันถึงห้องน้ำของตนได้ ภายในเล่ม ได้แบ่งเนื้อหาเป็นหัวข้อต่างๆ เพื่อนำเสนอแนวความคิดสำหรับห้องน้ำในยุคปัจจุบัน เพื่อให้ผู้อ่านตัดสินใจเลือกสิ่งที่เหมาะกับความต้องการของตนได้ชัดเจนยิ่งขึ้น",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201509/176483/5626facf968c9_XXL.jpg?imgname=%E0%B8%AB%E0%B9%89%E0%B8%AD%E0%B8%87%E0%B8%99%E0%B9%89%E0%B8%B3-Bathroom-Design--amp;-Ideas-(%E0%B8%9B%E0%B8%81%E0%B9%81%E0%B8%82%E0%B9%87%E0%B8%87)",
        price : "198.00 บาท",
      },
      {
        id: 3,
        name: "จงทำสวนของเรา",
        author : "ภัทรพร อภิชิต",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "บอกเล่าเรื่องราวการลงมือทำสิ่งของเครื่องใช้รอบตัวในชีวิตประจำวัน งานคราฟท์ ของใช้ในฟาร์ม การนำของเหลือใช้มาทำให้เกิดประโยชน์ การลงมือทำฟาร์ม ทำสวน เช่น ผนังบ้านดิน ทำเตาแบบต่าง ๆ วิธีก่อกองไฟ เลี้ยงเป็ดไก่ เมนูอาหาร ทำไม้กวาด ตัดเสื้อผ้าสำหรับทำสวน สอดแทรกแนวคิดการพึ่งพาตนเอง ใส่ใจต่อการใช้ทรัพยากรรอบตัวอย่างคุ้มค่า ตลอดจนมุ่งเน้นสร้างแรงบันดาลใจให้คนที่สนใจได้ลองลงมือทำสิ่งต่าง ๆ ด้วยตัวเอง บันทึกแบบเรียนเปลี่ยนชีวิตจากคนเมื่องสู่วิถี ชนบท กลับไปอยู่กับธรรมชาติ เรียนรู้จากการลงมือ ฝึกพึ่งพาตนเองอย่างสร้างสรรค์ ใน จงทำสวนของเรา",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201807/238469/1000209102_front_XXL.jpg?imgname=%E0%B8%88%E0%B8%87%E0%B8%97%E0%B8%B3%E0%B8%AA%E0%B8%A7%E0%B8%99%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%A3%E0%B8%B2-",
        price : "422.10 บาท",
      },
      {
        id: 4,
        name: "HOME DESIGN Vol.11 พื้นที่ใช้สอยน้อยกว่า 350 ตารางเมตร",
        author : "สมาคมธุรกิจรับสร้างบ้าน",
        publisher : "สมาคมฯรับสร้างบ้าน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "เหตุผลหลักของ หนังสือ Home Design รวมแบบบ้านสวยของบริษัทรับสร้างบ้านชั้นนำ จากสมาคมธุรกิจรับสร้างบ้านเล่มนี้ ที่ได้รวบรวมตัวอย่างบ้าน ขนาดพื้นที่ใช้สอยน้อยกว่า 350 ตารางเมตร ที่เพียบพร้อมด้วยสไตล์การตกแต่งและคุณภาพวัสดุอันหลากหลายจากบริษัทชั้นนำในราคาที่สามารถเอื้อมถึงได้ ทั้งยังมีความคิดเห็นและความประทับใจของผู้ใช้บริการบริษัทรับสร้างบ้านเป็นเครื่องยืนยันให้ฝันแห่งการอยู่อาศัยที่มีคุณภาพ แม้จะมีพื้นที่อันจำกัด สามารถเกิดขึ้นได้จริง รวมแบบบ้านสวยของบริษัทรับสร้างบ้านชั้นนำ หลากสไตล์ เช่น สไตล์โมเดิร์น, สไตล์อาร์ตเดโค, สไตล์โมเดิร์นคอนเทมโพรารี่, สไตล์โมเดิร์นทัสคานี, สไตล์โมเดิร์นทรอปิคอล, สไตล์คลาสสิก, สไตล์โมเดิร์นโอเรียนทัล, สไตล์คัลเจอรัล, สไตล์อิตาเลียน, สไตล์สแปนิช, สไตล์หรูหรา, สไตล์นีโอคลาสสิก, สไตล์ร่วมสมัย, สไตล์โอเรียนทัล, สไตล์โมเดิร์นลอฟต์, สไตล์โมเดิร์นรีสอร์ท",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201708/221128/1000199864_front_XXL.jpg?imgname=HOME-DESIGN-Vol.11-%E0%B8%9E%E0%B8%B7%E0%B9%89%E0%B8%99%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B9%83%E0%B8%8A%E0%B9%89%E0%B8%AA%E0%B8%AD%E0%B8%A2%E0%B8%99%E0%B9%89%E0%B8%AD%E0%B8%A2%E0%B8%81%E0%B8%A7%E0%B9%88%E0%B8%B2-350-%E0%B8%95%E0%B8%B2%E0%B8%A3%E0%B8%B2%E0%B8%87%E0%B9%80%E0%B8%A1%E0%B8%95%E0%B8%A3",
        price : "85.50 บาท",
      },
      {
        id: 5,
        name: "Refresh your home",
        author : "ศรายุทธ ศรีทิพย์อาสน์",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "นำเสนอวิธีการและไอเดียการคืนชีวิตให้บ้านกลับมาน่าอยู่มากขึ้น ซึ่งประกอบด้วย 3 ส่วนคือ 1.การปรับปรุงของเดิมให้น่าใช้ แนะนำการเปลี่ยนเฟอร์นิเจอร์เก่าในบ้านให้สวยและกลับมาใช้งานได้ดี รวมถึงการจัดบ้านให้เป็นระเบียบ 2.การตกแต่งให้น่าอยู่ แนะนำการตกแต่งภายในบ้านให้สวยงาม รู้จักการเลือกสี การตกแต่งผนัง การใช้วัสดุแต่งบ้าน และรู้เลือกเฟอร์นิเจอร์ให้เข้ากับสไตล์ห้อง 3.การปรับเปลี่ยนพื้นที่ให้ใช้งานสะดวก แนะนำการทำบิลท์อิน การกั้น-ขยายห้อง การติดตั้งชุดครัว และการทำมุมเก็บของในบ้าน",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201009/14735/1000095517_front_XXL.jpg?imgname=Refresh-your-home",
        price : "355.50 บาท",
      },
      {
        id: 5,
        name: "Vintage Garden",
        author : "ศิริวิทย์ ริ้วบำรุง/จาตุรงค์",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "รวบรวมผลงานการจัดสวนของนักออกแบบสองท่านตั้งแต่ปี 2552 จนถึงปัจจุบันมาไว้ในหนังสือ Vintage Garden เล่มนี้",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201110/25283/1000115185_front_XXL.jpg?imgname=Vintage-Garden",
        price : "355.50 บาท",
      },
      {
        id: 6,
        name: "บ้านหลังเล็ก my Little home",
        author : "กองบรรณาธิการนิตยสาร My Home",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "รวมบ้านหลังเล็ก ที่เจ้าของบ้านแต่ละหลังลงมือคัดสรร ตกแต่งบ้านให้ออกมาในสไตล์ที่ตัวเองชื่นชอบ บ่งบอกตัวตนของเจ้าของบ้านได้อย่างชัดเจน เป็นการแบ่งพื้นที่การใช้งานตามไลฟ์สไตล์ได้อย่างสวยงาม และน่าสนใจ ทำให้ได้เห็นรูปแบบการแต่งบ้านที่หลากหลาย เป็นไอเดียดีๆที่ใครก็สามารถแต่งบ้านของตัวเองให้สวยงามได้ รวมไปถึงการสอดแทรกเทคนิคการจัดบ้านหลังเล็กที่มีพื้นที่จำกัด ช่วยบริหารพื้นที่ที่มีอยู่น้อยนิดให้ใช้งานได้อย่างคุ้มค่า นำเสนอภาพสวยๆ ของบ้านขนาดกำลังดีที่มีความอบอุ่นของครอบครัว เพื่อเป็นแรงบันดาลใจในการแต่งบ้านที่ทุกคนเข้าถึงได้",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201809/242820/1000211849_front_XXL.jpg?imgname=-%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%87%E0%B9%80%E0%B8%A5%E0%B9%87%E0%B8%81-my-Little-home",
        price : "265.50 บาท",
      },
      {
        id: 7,
        name: "รวมพันธุ์ใหม่ แคคตัสและไม้อวบน้ำ Top Hit Cactus & Succulents",
        author : "ภวพล ศุภนันทนานนท์",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "ผู้เขียนและสำนักพิมพ์ตั้งใจอัพเดตข้อมูลใหม่ๆ ด้วยการรวมเรื่องราวการพัฒนาสายพันธุ์แคคตัสและไม้อวบน้ำในเมืองไทย และรวบรวมชนิดและลูกผสมพันธุ์ใหม่ๆ ที่คนไทยนำเข้ามาปลูกเลี้ยงและปรับปรุงพันธุ์ขึ้นจนได้รับการยอมรับในท้องตลาด มากกว่า 300 ชนิด/พันธุ์ เน้นตัวแปลก ใหม่ที่หาดูได้ยากและไม่ซ้ำกับเล่มเก่า แต่ละต้นจะบอกรายละเอียด ชื่อวิทยาศาสตร์ ถิ่นกำเนิด ความเป็นมา และการปลูกเลี้ยงพิเศษของต้นนั้นๆ  พร้อมแนะนำนักปลูกเลี้ยงและสะสมรุ่นใหม่ที่ยังไม่เคยตีพิมพ์ลงในเล่มของบ้านและสวนมาก่อน",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201905/479404/1000219492_front_XXL.jpg?imgname=%E0%B8%A3%E0%B8%A7%E0%B8%A1%E0%B8%9E%E0%B8%B1%E0%B8%99%E0%B8%98%E0%B8%B8%E0%B9%8C%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88-%E0%B9%81%E0%B8%84%E0%B8%84%E0%B8%95%E0%B8%B1%E0%B8%AA%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B9%84%E0%B8%A1%E0%B9%89%E0%B8%AD%E0%B8%A7%E0%B8%9A%E0%B8%99%E0%B9%89%E0%B8%B3-Top-Hit-Cactus---Succulents",
        price : "405.00 บาท",
      },
      {
        id: 8,
        name: "ครัวคู่บ้าน Kitchen Design&Ideas ปกแข็ง",
        author : "เศรษฐพงศ์ เผ่าวัฒนา",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "รวมการตกแต่งห้องครัวหลายแบบ พร้อมคำอธิบายเรื่องการออกแบบการจัดพื้นที่ใช้สอย สไตล์ วัสดุต่างๆ ฯลฯ เป็นแนวทางให้ผู้อ่านได้ค้นหาแบบของครัวที่เหมาะกับตัวเอง “ครัวคือหัวใจของบ้าน” เป็นความจริงที่ใช้ได้เสมอ แม้การดำเนินชีวิตในปัจจุบันของคนไทยจะเปลี่ยนแปรไป การใช้ชีวิตเป็นอิสระมากขึ้น ทำให้แต่ละคนดำเนินชีวิตต่างกัน หลายคนชอบทำอาหาร หลายคนชอบการสังสรรค์นอกบ้าน หลายคนมีชีวิตเร่งรีบ ฯลฯ สิ่งเหล่านี้ล้วนส่งผลกับห้องครัว จากครัวไทยๆ ที่เคยอึกทึกครึมโครมด้วยเสียงโขลกน้ำพริก อบอวลด้วยกลิ่นควันจากฟืนที่จุดขึ้นเพื่อปรุงอาหาร ก็ปรับเปลี่ยนมาสู่ยุคที่ในครัวพรั่งพร้อม ด้วยอุปกรณ์ไฟฟ้ามากหน้าหลายตาที่ช่วยให้การทำอาหารสะดวกมากขึ้น จนกระทั่งมาถึงจุดที่ครัวเป็นแค่มุมเล็กจิ๋วที่ซ่อนตัวอยู่สักที่ในบ้าน เพราะมีอาหารสำเร็จรูปแช่แข็งให้เราได้อุ่นกิน",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201510/178068/5632dba802d6a_XXL.jpg?imgname=%E0%B8%84%E0%B8%A3%E0%B8%B1%E0%B8%A7%E0%B8%84%E0%B8%B9%E0%B9%88%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%99-Kitchen-Design-amp;Ideas-%E0%B8%9B%E0%B8%81%E0%B9%81%E0%B8%82%E0%B9%87%E0%B8%87",
        price : "355.50 บาท",
      },
      {
        id: 9,
        name: "ตรวจสุขภาพบ้านก่อนรับโอน (ฉบับปรับปรุง)",
        author : "วิญญู วานิชศิริโรจน์",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "โครงการบ้านจัดสรรมักไม่ยอมให้ผู้ซื้อบ้านเข้าไปในสถานที่ก่อสร้างระหว่างการก่อสร้าง เราจึงต้องให้ความสำคัญกับการตรวจสอบบ้านก่อนรับโอนมากยิ่งขึ้น เพราะเจ้าของบ้านมีเพียงโอกาสนี้โอกาสเดียวที่จะสามารถตรวจสอบคุณภาพงานก่อสร้างของบ้านก่อนที่จะรับโอนกรรมสิทธิ์จากโครงการ หนังสือ ตรวจสุขภาพบ้านก่อนรับโอน เล่มนี้ เขียนสำหรับคนทั่วไปที่ไม่ได้เรียนหรือทำงานด้านก่อสร้าง สามารถอ่านเข้าใจได้ง่าย ไม่เน้นข้อมูลด้านเทคนิค แต่ทำให้ผู้อ่านนำหลักการและวิธีการไปใช้งานได้อย่างไม่ลำบาก ไม่ได้มีเป้าหมายให้คนอ่านเปลี่ยนตัวเองเป็นนายช่าง หรือนางช่าง หรือนางสาวช่างที่สามารถ รื้อ ขุด ดูส่วนประกอบภายในของบ้าน เพื่อตรวจสอบระบบต่างๆ ได้อย่างมืออาชีพแต่อย่างใด เนี้อหาที่นำเสนอจะเน้นวิธีตรวจสอบบ้านที่มองเห็นได้จากภายนอก และคนทั่วไปสามารถดำเนินการได้เป็นสำคัญ",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201805/235633/1000207659_front_XXL.jpg?imgname=%E0%B8%95%E0%B8%A3%E0%B8%A7%E0%B8%88%E0%B8%AA%E0%B8%B8%E0%B8%82%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B8%81%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B9%82%E0%B8%AD%E0%B8%99-(%E0%B8%89%E0%B8%9A%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%A3%E0%B8%B8%E0%B8%87)",
        price : "238.50 บาท",
      },
      {
        id: 10,
        name: "จะเป็นนักจัดสวน",
        author : "เอื้อมพร วีสมหมาย",
        publisher : "บ้านและสวน",
        category: "บ้านและสวน บ้านและสวน",
        detail: "อาชีพจัดสวนเป็นอาชีพอิสระที่แม้ไม่ได้เรียนมาโดยตรงแต่หากมีใจรักก็สามารถประกอบอาชีพนี้ได้ นอกจากเรียนรู้จากการฝึกฝนแล้ว ยังสามารถหาความรู้จากสถานที่ต่างๆได้รอบตัว รวมถึงใช้หนังสือเล่มนี้เป็นแนวทาง ซึ่งมีทั้งความรู้เรื่องต้นไม้และศิลปะ ผนวกกับการหัดสังกต วิเคราะห์ สังเคราะห์ข้อมูล และคำนวนงบประมาณต่างๆในการจัดสวน เพื่อไม่เสี่ยงต่อการขาดทุน เสริมด้วยเคล็ดลับจากนักจัดสวนมืออาชีพ อาทิ หากเขียนแบบไม่ถนัดจะสื่อสารกับลูกค้าได้อย่างไร หากงบประมาณที่นำเสนอลูกค้าสูงเกินไปจะแก้ไขอย่างไรดี การประเมินราคาที่ไม่เสี่ยงต่อภาวะขาดทุน ฯลฯ คู่มือสำหรับผู้ต้องการประกอบอาชีพจัดสวนหรือนักจัดสวนที่กำลังค้นหาเส้นทางไปสู่ความสำเร็จอย่างยั่งยืนรวมถึงคนรักสวนทั่วไปที่กำลังคิดอยากจัดสวน",
        img :"https://storage.naiin.com/system/application/bookstore/resource/product/201902/251168/1000215844_front_XXL.jpg?imgname=%E0%B8%88%E0%B8%B0%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B8%99%E0%B8%B1%E0%B8%81%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%AA%E0%B8%A7%E0%B8%99-",
        price : "247.50 บาท",
      },
      
    ];



  }


  loadbookschina(){
    return Promise.resolve(this.bookschina);
    }
  
  Idbookschina(Idbookschina:any){
    let china = this.bookschina.find( ({id}) => id===Idbookschina );
      return Promise.resolve(china);
    }



  loadbookscomic(){
      return Promise.resolve(this.bookscomic);
      }
    
  Idbookscomic(Idbookscomic:any){
      let comic = this.bookscomic.find( ({id}) => id===Idbookscomic );
        return Promise.resolve(comic);
      }


  loadyunovelbook(){
        return Promise.resolve(this.yunovelbook);
        }
      
  Idyunovelbook(Idyunovelbook:any){
        let yunove = this.yunovelbook.find( ({id}) => id===Idyunovelbook );
          return Promise.resolve(yunove);
        }


  loadliteraturebooks(){
          return Promise.resolve(this.literaturebooks);
          }
        
  Idliteraturebooks(Idliteraturebooks:any){
        let literaturebooks = this.literaturebooks.find( ({id}) => id===Idliteraturebooks );
          return Promise.resolve(literaturebooks);
          }


  loadhomebooks(){
          return Promise.resolve(this.homebooks);
           }
          
  Idhomebooks(Idhomebooks:any){
          let home = this.homebooks.find( ({id}) => id===Idhomebooks );
         return Promise.resolve(home);
           }

}
